; ModuleID = 'test.bc'
source_filename = "test.cpp"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.std::__1::atomic" = type { %"struct.std::__1::__atomic_base" }
%"struct.std::__1::__atomic_base" = type { %"struct.std::__1::__atomic_base.0" }
%"struct.std::__1::__atomic_base.0" = type { i8 }
%"struct.std::__1::atomic.1" = type { %"struct.std::__1::__atomic_base.2" }
%"struct.std::__1::__atomic_base.2" = type { %"struct.std::__1::__atomic_base.3" }
%"struct.std::__1::__atomic_base.3" = type { i8 }
%"struct.std::__1::atomic.4" = type { %"struct.std::__1::__atomic_base.5" }
%"struct.std::__1::__atomic_base.5" = type { %"struct.std::__1::__atomic_base.6" }
%"struct.std::__1::__atomic_base.6" = type { i8 }
%"struct.std::__1::atomic.7" = type { %"struct.std::__1::__atomic_base.8" }
%"struct.std::__1::__atomic_base.8" = type { %"struct.std::__1::__atomic_base.9" }
%"struct.std::__1::__atomic_base.9" = type { i16 }
%"struct.std::__1::atomic.10" = type { %"struct.std::__1::__atomic_base.11" }
%"struct.std::__1::__atomic_base.11" = type { %"struct.std::__1::__atomic_base.12" }
%"struct.std::__1::__atomic_base.12" = type { i16 }
%"struct.std::__1::atomic.13" = type { %"struct.std::__1::__atomic_base.14" }
%"struct.std::__1::__atomic_base.14" = type { %"struct.std::__1::__atomic_base.15" }
%"struct.std::__1::__atomic_base.15" = type { i32 }
%"struct.std::__1::atomic.16" = type { %"struct.std::__1::__atomic_base.17" }

!2223 = !DIFile(filename: "/usr/include/_types/_uint32_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2224 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2225, line: 161)
!2225 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !2226, line: 31, baseType: !1283)
!2226 = !DIFile(filename: "/usr/include/_types/_uint64_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2227 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2228, line: 163)
!2228 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !2229, line: 29, baseType: !2204)
!2229 = !DIFile(filename: "/usr/include/stdint.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2230 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2231, line: 164)
!2231 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !2229, line: 30, baseType: !2207)
!2232 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2233, line: 165)
!2233 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !2229, line: 31, baseType: !2210)
!2234 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2235, line: 166)
!2235 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !2229, line: 32, baseType: !2213)
!2236 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2237, line: 168)
!2237 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !2229, line: 33, baseType: !2216)
!2238 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2239, line: 169)
!2239 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !2229, line: 34, baseType: !2219)
!2240 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2241, line: 170)
!2241 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !2229, line: 35, baseType: !2222)
!2242 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2243, line: 171)
!2243 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !2229, line: 36, baseType: !2225)
!2244 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2245, line: 173)
!2245 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !2229, line: 40, baseType: !2204)
!2246 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2247, line: 174)
!2247 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !2229, line: 41, baseType: !2207)
!2248 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2249, line: 175)
!2249 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !2229, line: 42, baseType: !2210)
!2250 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2251, line: 176)
!2251 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !2229, line: 43, baseType: !2213)
!2252 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2253, line: 178)
!2253 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !2229, line: 44, baseType: !2216)
!2254 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2255, line: 179)
!2255 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !2229, line: 45, baseType: !2219)
!2256 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2257, line: 180)
!2257 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !2229, line: 46, baseType: !2222)
!2258 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2259, line: 181)
!2259 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !2229, line: 47, baseType: !2225)
!2260 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2261, line: 183)
!2261 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !2262, line: 30, baseType: !2263)
!2262 = !DIFile(filename: "/usr/include/sys/_types/_intptr_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !2120, line: 49, baseType: !815)
!2264 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2265, line: 184)
!2265 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !2266, line: 30, baseType: !971)
!2266 = !DIFile(filename: "/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2267 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2268, line: 186)
!2268 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !2269, line: 32, baseType: !815)
!2269 = !DIFile(filename: "/usr/include/_types/_intmax_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2270 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2271, line: 187)
!2271 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !2272, line: 32, baseType: !971)
!2272 = !DIFile(filename: "/usr/include/_types/_uintmax_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2273 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2117, line: 100)
!2274 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2275, line: 101)
!2275 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !2276, line: 85, baseType: !2277)
!2276 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2277 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2276, line: 82, size: 64, elements: !2278, identifier: "_ZTS5div_t")
!2278 = !{!2279, !2280}
!2279 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !2277, file: !2276, line: 83, baseType: !133, size: 32)
!2280 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !2277, file: !2276, line: 84, baseType: !133, size: 32, offset: 32)
!2281 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2282, line: 102)
!2282 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !2276, line: 90, baseType: !2283)
!2283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2276, line: 87, size: 128, elements: !2284, identifier: "_ZTS6ldiv_t")
!2284 = !{!2285, !2286}
!2285 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !2283, file: !2276, line: 88, baseType: !815, size: 64)
!2286 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !2283, file: !2276, line: 89, baseType: !815, size: 64, offset: 64)
!2287 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2288, line: 104)
!2288 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !2276, line: 96, baseType: !2289)
!2289 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2276, line: 93, size: 128, elements: !2290, identifier: "_ZTS7lldiv_t")
!2290 = !{!2291, !2292}
!2291 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !2289, file: !2276, line: 94, baseType: !1127, size: 64)
!2292 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !2289, file: !2276, line: 95, baseType: !1127, size: 64, offset: 64)
!2293 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2294, line: 106)
!2294 = !DISubprogram(name: "atof", scope: !2276, file: !2276, line: 131, type: !2295, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2295 = !DISubroutineType(types: !2296)
!2296 = !{!2297, !2142}
!2297 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!2298 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2299, line: 107)
!2299 = !DISubprogram(name: "atoi", scope: !2276, file: !2276, line: 132, type: !2300, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2300 = !DISubroutineType(types: !2301)
!2301 = !{!133, !2142}
!2302 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2303, line: 108)
!2303 = !DISubprogram(name: "atol", scope: !2276, file: !2276, line: 133, type: !2304, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2304 = !DISubroutineType(types: !2305)
!2305 = !{!815, !2142}
!2306 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2307, line: 110)
!2307 = !DISubprogram(name: "atoll", scope: !2276, file: !2276, line: 136, type: !2308, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2308 = !DISubroutineType(types: !2309)
!2309 = !{!1127, !2142}
!2310 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2311, line: 112)
!2311 = !DISubprogram(name: "strtod", linkageName: "\01_strtod", scope: !2276, file: !2276, line: 162, type: !2312, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2312 = !DISubroutineType(types: !2313)
!2313 = !{!2297, !2142, !2314}
!2314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2140, size: 64)
!2315 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2316, line: 113)
!2316 = !DISubprogram(name: "strtof", linkageName: "\01_strtof", scope: !2276, file: !2276, line: 163, type: !2317, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2317 = !DISubroutineType(types: !2318)
!2318 = !{!2319, !2142, !2314}
!2319 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!2320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2321, line: 114)
!2321 = !DISubprogram(name: "strtold", scope: !2276, file: !2276, line: 166, type: !2322, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2322 = !DISubroutineType(types: !2323)
!2323 = !{!2124, !2142, !2314}
!2324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2325, line: 115)
!2325 = !DISubprogram(name: "strtol", scope: !2276, file: !2276, line: 164, type: !2326, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2326 = !DISubroutineType(types: !2327)
!2327 = !{!815, !2142, !2314, !133}
!2328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2329, line: 117)
!2329 = !DISubprogram(name: "strtoll", scope: !2276, file: !2276, line: 169, type: !2330, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2330 = !DISubroutineType(types: !2331)
!2331 = !{!1127, !2142, !2314, !133}
!2332 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2333, line: 119)
!2333 = !DISubprogram(name: "strtoul", scope: !2276, file: !2276, line: 172, type: !2334, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2334 = !DISubroutineType(types: !2335)
!2335 = !{!971, !2142, !2314, !133}
!2336 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2337, line: 121)
!2337 = !DISubprogram(name: "strtoull", scope: !2276, file: !2276, line: 175, type: !2338, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2338 = !DISubroutineType(types: !2339)
!2339 = !{!1283, !2142, !2314, !133}
!2340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2341, line: 123)
!2341 = !DISubprogram(name: "rand", scope: !2276, file: !2276, line: 159, type: !2342, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2342 = !DISubroutineType(types: !2343)
!2343 = !{!133}
!2344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2345, line: 124)
!2345 = !DISubprogram(name: "srand", scope: !2276, file: !2276, line: 161, type: !2346, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2346 = !DISubroutineType(types: !2347)
!2347 = !{null, !659}
!2348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2349, line: 125)
!2349 = !DISubprogram(name: "calloc", scope: !2276, file: !2276, line: 140, type: !2350, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2350 = !DISubroutineType(types: !2351)
!2351 = !{!2131, !2117, !2117}
!2352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2353, line: 126)
!2353 = !DISubprogram(name: "free", scope: !2276, file: !2276, line: 143, type: !2354, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2354 = !DISubroutineType(types: !2355)
!2355 = !{null, !2131}
!2356 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2357, line: 127)
!2357 = !DISubprogram(name: "malloc", scope: !2276, file: !2276, line: 152, type: !2358, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2358 = !DISubroutineType(types: !2359)
!2359 = !{!2131, !2117}
!2360 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2361, line: 128)
!2361 = !DISubprogram(name: "realloc", scope: !2276, file: !2276, line: 160, type: !2362, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2362 = !DISubroutineType(types: !2363)
!2363 = !{!2131, !2131, !2117}
!2364 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2365, line: 129)
!2365 = !DISubprogram(name: "abort", scope: !2276, file: !2276, line: 128, type: !2366, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!2366 = !DISubroutineType(types: !2367)
!2367 = !{null}
!2368 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2369, line: 130)
!2369 = !DISubprogram(name: "atexit", scope: !2276, file: !2276, line: 130, type: !2370, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2370 = !DISubroutineType(types: !2371)
!2371 = !{!133, !2372}
!2372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2366, size: 64)
!2373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2374, line: 131)
!2374 = !DISubprogram(name: "exit", scope: !2276, file: !2276, line: 142, type: !2375, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!2375 = !DISubroutineType(types: !2376)
!2376 = !{null, !133}
!2377 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2378, line: 132)
!2378 = !DISubprogram(name: "_Exit", scope: !2276, file: !2276, line: 182, type: !2375, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!2379 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2380, line: 134)
!2380 = !DISubprogram(name: "getenv", scope: !2276, file: !2276, line: 144, type: !2381, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2381 = !DISubroutineType(types: !2382)
!2382 = !{!2140, !2142}
!2383 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2384, line: 135)
!2384 = !DISubprogram(name: "system", linkageName: "\01_system", scope: !2276, file: !2276, line: 177, type: !2300, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2386, line: 137)
!2386 = !DISubprogram(name: "bsearch", scope: !2276, file: !2276, line: 138, type: !2387, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2387 = !DISubroutineType(types: !2388)
!2388 = !{!2131, !2132, !2132, !2117, !2117, !2389}
!2389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2390, size: 64)
!2390 = !DISubroutineType(types: !2391)
!2391 = !{!133, !2132, !2132}
!2392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2393, line: 138)
!2393 = !DISubprogram(name: "qsort", scope: !2276, file: !2276, line: 157, type: !2394, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2394 = !DISubroutineType(types: !2395)
!2395 = !{null, !2131, !2117, !2117, !2389}
!2396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2397, line: 139)
!2397 = !DISubprogram(name: "abs", linkageName: "_Z3absx", scope: !2398, file: !2398, line: 113, type: !2399, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2398 = !DIFile(filename: "/Users/aser/Documents/LLVM/llvm-4.0/build/bin/../include/c++/v1/stdlib.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2399 = !DISubroutineType(types: !2400)
!2400 = !{!1127, !1127}
!2401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2402, line: 140)
!2402 = !DISubprogram(name: "labs", scope: !2276, file: !2276, line: 145, type: !2403, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2403 = !DISubroutineType(types: !2404)
!2404 = !{!815, !815}
!2405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2406, line: 142)
!2406 = !DISubprogram(name: "llabs", scope: !2276, file: !2276, line: 149, type: !2399, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2408, line: 144)
!2408 = !DISubprogram(name: "div", linkageName: "_Z3divxx", scope: !2398, file: !2398, line: 118, type: !2409, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2409 = !DISubroutineType(types: !2410)
!2410 = !{!2288, !1127, !1127}
!2411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2412, line: 145)
!2412 = !DISubprogram(name: "ldiv", scope: !2276, file: !2276, line: 146, type: !2413, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2413 = !DISubroutineType(types: !2414)
!2414 = !{!2282, !815, !815}
!2415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2416, line: 147)
!2416 = !DISubprogram(name: "lldiv", scope: !2276, file: !2276, line: 150, type: !2409, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2418, line: 149)
!2418 = !DISubprogram(name: "mblen", scope: !2276, file: !2276, line: 153, type: !2419, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2419 = !DISubroutineType(types: !2420)
!2420 = !{!133, !2142, !2117}
!2421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2422, line: 150)
!2422 = !DISubprogram(name: "mbtowc", scope: !2276, file: !2276, line: 155, type: !2423, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2423 = !DISubroutineType(types: !2424)
!2424 = !{!133, !2425, !2142, !2117}
!2425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1751, size: 64)
!2426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2427, line: 151)
!2427 = !DISubprogram(name: "wctomb", scope: !2276, file: !2276, line: 179, type: !2428, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2428 = !DISubroutineType(types: !2429)
!2429 = !{!133, !2140, !1751}
!2430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2431, line: 152)
!2431 = !DISubprogram(name: "mbstowcs", scope: !2276, file: !2276, line: 154, type: !2432, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2432 = !DISubroutineType(types: !2433)
!2433 = !{!2117, !2425, !2142, !2117}
!2434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2435, line: 153)
!2435 = !DISubprogram(name: "wcstombs", scope: !2276, file: !2276, line: 178, type: !2436, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2436 = !DISubroutineType(types: !2437)
!2437 = !{!2117, !2140, !2438, !2117}
!2438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2439, size: 64)
!2439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1751)
!2440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2441, line: 108)
!2441 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !2442, line: 153, baseType: !2443)
!2442 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !2442, line: 122, size: 1216, elements: !2444, identifier: "_ZTS7__sFILE")
!2444 = !{!2445, !2447, !2448, !2449, !2450, !2451, !2456, !2457, !2458, !2462, !2466, !2474, !2478, !2479, !2482, !2483, !2487, !2491, !2492, !2493}
!2445 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !2443, file: !2442, line: 123, baseType: !2446, size: 64)
!2446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!2447 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !2443, file: !2442, line: 124, baseType: !133, size: 32, offset: 64)
!2448 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !2443, file: !2442, line: 125, baseType: !133, size: 32, offset: 96)
!2449 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !2443, file: !2442, line: 126, baseType: !347, size: 16, offset: 128)
!2450 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !2443, file: !2442, line: 127, baseType: !347, size: 16, offset: 144)
!2451 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !2443, file: !2442, line: 128, baseType: !2452, size: 128, offset: 192)
!2452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !2442, line: 88, size: 128, elements: !2453, identifier: "_ZTS6__sbuf")
!2453 = !{!2454, !2455}
!2454 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !2452, file: !2442, line: 89, baseType: !2446, size: 64)
!2455 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !2452, file: !2442, line: 90, baseType: !133, size: 32, offset: 64)
!2456 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !2443, file: !2442, line: 129, baseType: !133, size: 32, offset: 320)
!2457 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !2443, file: !2442, line: 132, baseType: !2131, size: 64, offset: 384)
!2458 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !2443, file: !2442, line: 133, baseType: !2459, size: 64, offset: 448)
!2459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2460, size: 64)
!2460 = !DISubroutineType(types: !2461)
!2461 = !{!133, !2131}
!2462 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !2443, file: !2442, line: 134, baseType: !2463, size: 64, offset: 512)
!2463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2464, size: 64)
!2464 = !DISubroutineType(types: !2465)
!2465 = !{!133, !2131, !2140, !133}
!2466 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !2443, file: !2442, line: 135, baseType: !2467, size: 64, offset: 576)
!2467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2468, size: 64)
!2468 = !DISubroutineType(types: !2469)
!2469 = !{!2470, !2131, !2470, !133}
!2470 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !2442, line: 77, baseType: !2471)
!2471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !2472, line: 71, baseType: !2473)
!2472 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2473 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !2120, line: 46, baseType: !1127)
!2474 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !2443, file: !2442, line: 136, baseType: !2475, size: 64, offset: 640)
!2475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2476, size: 64)
!2476 = !DISubroutineType(types: !2477)
!2477 = !{!133, !2131, !2142, !133}
!2478 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !2443, file: !2442, line: 139, baseType: !2452, size: 128, offset: 704)
!2479 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !2443, file: !2442, line: 140, baseType: !2480, size: 64, offset: 832)
!2480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2481, size: 64)
!2481 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !2442, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!2482 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !2443, file: !2442, line: 141, baseType: !133, size: 32, offset: 896)
!2483 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !2443, file: !2442, line: 144, baseType: !2484, size: 24, offset: 928)
!2484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 24, elements: !2485)
!2485 = !{!2486}
!2486 = !DISubrange(count: 3)
!2487 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !2443, file: !2442, line: 145, baseType: !2488, size: 8, offset: 952)
!2488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 8, elements: !2489)
!2489 = !{!2490}
!2490 = !DISubrange(count: 1)
!2491 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !2443, file: !2442, line: 148, baseType: !2452, size: 128, offset: 960)
!2492 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !2443, file: !2442, line: 151, baseType: !133, size: 32, offset: 1088)
!2493 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !2443, file: !2442, line: 152, baseType: !2470, size: 64, offset: 1152)
!2494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2470, line: 109)
!2495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2117, line: 110)
!2496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2497, line: 112)
!2497 = !DISubprogram(name: "fclose", scope: !2442, file: !2442, line: 232, type: !2498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2498 = !DISubroutineType(types: !2499)
!2499 = !{!133, !2500}
!2500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2441, size: 64)
!2501 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2502, line: 113)
!2502 = !DISubprogram(name: "fflush", scope: !2442, file: !2442, line: 235, type: !2498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2504, line: 114)
!2504 = !DISubprogram(name: "setbuf", scope: !2442, file: !2442, line: 267, type: !2505, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2505 = !DISubroutineType(types: !2506)
!2506 = !{null, !2500, !2140}
!2507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2508, line: 115)
!2508 = !DISubprogram(name: "setvbuf", scope: !2442, file: !2442, line: 268, type: !2509, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2509 = !DISubroutineType(types: !2510)
!2510 = !{!133, !2500, !2140, !133, !2117}
!2511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2512, line: 116)
!2512 = !DISubprogram(name: "fprintf", scope: !2442, file: !2442, line: 244, type: !2513, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2513 = !DISubroutineType(types: !2514)
!2514 = !{!133, !2500, !2142, null}
!2515 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2516, line: 117)
!2516 = !DISubprogram(name: "fscanf", scope: !2442, file: !2442, line: 250, type: !2513, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2517 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2518, line: 118)
!2518 = !DISubprogram(name: "snprintf", scope: !2442, file: !2442, line: 421, type: !2519, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2519 = !DISubroutineType(types: !2520)
!2520 = !{!133, !2140, !2117, !2142, null}
!2521 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2522, line: 119)
!2522 = !DISubprogram(name: "sprintf", scope: !2442, file: !2442, line: 269, type: !2523, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2523 = !DISubroutineType(types: !2524)
!2524 = !{!133, !2140, !2142, null}
!2525 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2526, line: 120)
!2526 = !DISubprogram(name: "sscanf", scope: !2442, file: !2442, line: 270, type: !2527, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2527 = !DISubroutineType(types: !2528)
!2528 = !{!133, !2142, !2142, null}
!2529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2530, line: 121)
!2530 = !DISubprogram(name: "vfprintf", scope: !2442, file: !2442, line: 278, type: !2531, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2531 = !DISubroutineType(types: !2532)
!2532 = !{!133, !2500, !2142, !2533}
!2533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2534, size: 64)
!2534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !2535, identifier: "_ZTS13__va_list_tag")
!2535 = !{!2536, !2537, !2538, !2539}
!2536 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !2534, file: !3, baseType: !659, size: 32)
!2537 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !2534, file: !3, baseType: !659, size: 32, offset: 32)
!2538 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !2534, file: !3, baseType: !2131, size: 64, offset: 64)
!2539 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !2534, file: !3, baseType: !2131, size: 64, offset: 128)
!2540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2541, line: 122)
!2541 = !DISubprogram(name: "vfscanf", scope: !2442, file: !2442, line: 422, type: !2531, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2543, line: 123)
!2543 = !DISubprogram(name: "vsscanf", scope: !2442, file: !2442, line: 425, type: !2544, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2544 = !DISubroutineType(types: !2545)
!2545 = !{!133, !2142, !2142, !2533}
!2546 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2547, line: 124)
!2547 = !DISubprogram(name: "vsnprintf", scope: !2442, file: !2442, line: 424, type: !2548, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2548 = !DISubroutineType(types: !2549)
!2549 = !{!133, !2140, !2117, !2142, !2533}
!2550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2551, line: 125)
!2551 = !DISubprogram(name: "vsprintf", scope: !2442, file: !2442, line: 280, type: !2552, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2552 = !DISubroutineType(types: !2553)
!2553 = !{!133, !2140, !2142, !2533}
!2554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2555, line: 126)
!2555 = !DISubprogram(name: "fgetc", scope: !2442, file: !2442, line: 236, type: !2498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2557, line: 127)
!2557 = !DISubprogram(name: "fgets", scope: !2442, file: !2442, line: 238, type: !2558, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2558 = !DISubroutineType(types: !2559)
!2559 = !{!2140, !2140, !133, !2500}
!2560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2561, line: 128)
!2561 = !DISubprogram(name: "fputc", scope: !2442, file: !2442, line: 245, type: !2562, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2562 = !DISubroutineType(types: !2563)
!2563 = !{!133, !133, !2500}
!2564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2565, line: 129)
!2565 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !2442, file: !2442, line: 246, type: !2566, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2566 = !DISubroutineType(types: !2567)
!2567 = !{!133, !2142, !2500}
!2568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2569, line: 130)
!2569 = !DISubprogram(name: "getc", scope: !2442, file: !2442, line: 255, type: !2498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2571, line: 131)
!2571 = !DISubprogram(name: "putc", scope: !2442, file: !2442, line: 260, type: !2562, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2573, line: 132)
!2573 = !DISubprogram(name: "ungetc", scope: !2442, file: !2442, line: 277, type: !2562, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2575, line: 133)
!2575 = !DISubprogram(name: "fread", scope: !2442, file: !2442, line: 247, type: !2576, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2576 = !DISubroutineType(types: !2577)
!2577 = !{!2117, !2131, !2117, !2117, !2500}
!2578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2579, line: 134)
!2579 = !DISubprogram(name: "fwrite", linkageName: "\01_fwrite", scope: !2442, file: !2442, line: 254, type: !2580, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2580 = !DISubroutineType(types: !2581)
!2581 = !{!2117, !2132, !2117, !2117, !2500}
!2582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2583, line: 135)
!2583 = !DISubprogram(name: "fgetpos", scope: !2442, file: !2442, line: 237, type: !2584, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2584 = !DISubroutineType(types: !2585)
!2585 = !{!133, !2500, !2586}
!2586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2470, size: 64)
!2587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2588, line: 136)
!2588 = !DISubprogram(name: "fseek", scope: !2442, file: !2442, line: 251, type: !2589, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2589 = !DISubroutineType(types: !2590)
!2590 = !{!133, !2500, !815, !133}
!2591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2592, line: 137)
!2592 = !DISubprogram(name: "fsetpos", scope: !2442, file: !2442, line: 252, type: !2593, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2593 = !DISubroutineType(types: !2594)
!2594 = !{!133, !2500, !2595}
!2595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2596, size: 64)
!2596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2470)
!2597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2598, line: 138)
!2598 = !DISubprogram(name: "ftell", scope: !2442, file: !2442, line: 253, type: !2599, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2599 = !DISubroutineType(types: !2600)
!2600 = !{!815, !2500}
!2601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2602, line: 139)
!2602 = !DISubprogram(name: "rewind", scope: !2442, file: !2442, line: 265, type: !2603, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2603 = !DISubroutineType(types: !2604)
!2604 = !{null, !2500}
!2605 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2606, line: 140)
!2606 = !DISubprogram(name: "clearerr", scope: !2442, file: !2442, line: 231, type: !2603, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2608, line: 141)
!2608 = !DISubprogram(name: "feof", scope: !2442, file: !2442, line: 233, type: !2498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2610, line: 142)
!2610 = !DISubprogram(name: "ferror", scope: !2442, file: !2442, line: 234, type: !2498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2611 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2612, line: 143)
!2612 = !DISubprogram(name: "perror", scope: !2442, file: !2442, line: 258, type: !2613, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2613 = !DISubroutineType(types: !2614)
!2614 = !{null, !2142}
!2615 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2616, line: 146)
!2616 = !DISubprogram(name: "fopen", linkageName: "\01_fopen", scope: !2442, file: !2442, line: 242, type: !2617, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2617 = !DISubroutineType(types: !2618)
!2618 = !{!2500, !2142, !2142}
!2619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2620, line: 147)
!2620 = !DISubprogram(name: "freopen", linkageName: "\01_freopen", scope: !2442, file: !2442, line: 248, type: !2621, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2621 = !DISubroutineType(types: !2622)
!2622 = !{!2500, !2142, !2142, !2500}
!2623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2624, line: 148)
!2624 = !DISubprogram(name: "remove", scope: !2442, file: !2442, line: 263, type: !2300, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2626, line: 149)
!2626 = !DISubprogram(name: "rename", scope: !2442, file: !2442, line: 264, type: !2158, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2628, line: 150)
!2628 = !DISubprogram(name: "tmpfile", scope: !2442, file: !2442, line: 271, type: !2629, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2629 = !DISubroutineType(types: !2630)
!2630 = !{!2500}
!2631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2632, line: 151)
!2632 = !DISubprogram(name: "tmpnam", scope: !2442, file: !2442, line: 276, type: !2633, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2633 = !DISubroutineType(types: !2634)
!2634 = !{!2140, !2140}
!2635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2636, line: 155)
!2636 = !DISubprogram(name: "getchar", scope: !2442, file: !2442, line: 256, type: !2342, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2638, line: 157)
!2638 = !DISubprogram(name: "gets", scope: !2442, file: !2442, line: 257, type: !2633, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2640, line: 159)
!2640 = !DISubprogram(name: "scanf", scope: !2442, file: !2442, line: 266, type: !2641, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2641 = !DISubroutineType(types: !2642)
!2642 = !{!133, !2142, null}
!2643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2644, line: 160)
!2644 = !DISubprogram(name: "vscanf", scope: !2442, file: !2442, line: 423, type: !2645, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2645 = !DISubroutineType(types: !2646)
!2646 = !{!133, !2142, !2533}
!2647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2648, line: 164)
!2648 = !DISubprogram(name: "printf", scope: !2442, file: !2442, line: 259, type: !2641, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2650, line: 165)
!2650 = !DISubprogram(name: "putchar", scope: !2442, file: !2442, line: 261, type: !2651, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2651 = !DISubroutineType(types: !2652)
!2652 = !{!133, !133}
!2653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2654, line: 166)
!2654 = !DISubprogram(name: "puts", scope: !2442, file: !2442, line: 262, type: !2300, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2656, line: 167)
!2656 = !DISubprogram(name: "vprintf", scope: !2442, file: !2442, line: 279, type: !2645, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2658, line: 104)
!2658 = !DISubprogram(name: "isalnum", linkageName: "_Z7isalnumi", scope: !2659, file: !2659, line: 212, type: !2651, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2659 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2660 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2661, line: 105)
!2661 = !DISubprogram(name: "isalpha", linkageName: "_Z7isalphai", scope: !2659, file: !2659, line: 218, type: !2651, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2662 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2663, line: 106)
!2663 = !DISubprogram(name: "isblank", linkageName: "_Z7isblanki", scope: !2659, file: !2659, line: 224, type: !2651, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2664 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2665, line: 107)
!2665 = !DISubprogram(name: "iscntrl", linkageName: "_Z7iscntrli", scope: !2659, file: !2659, line: 230, type: !2651, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2666 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2667, line: 108)
!2667 = !DISubprogram(name: "isdigit", linkageName: "_Z7isdigiti", scope: !2659, file: !2659, line: 237, type: !2651, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2668 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2669, line: 109)
!2669 = !DISubprogram(name: "isgraph", linkageName: "_Z7isgraphi", scope: !2659, file: !2659, line: 243, type: !2651, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2670 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2671, line: 110)
!2671 = !DISubprogram(name: "islower", linkageName: "_Z7isloweri", scope: !2659, file: !2659, line: 249, type: !2651, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2672 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2673, line: 111)
!2673 = !DISubprogram(name: "isprint", linkageName: "_Z7isprinti", scope: !2659, file: !2659, line: 255, type: !2651, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2674 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2675, line: 112)
!2675 = !DISubprogram(name: "ispunct", linkageName: "_Z7ispuncti", scope: !2659, file: !2659, line: 261, type: !2651, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2676 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2677, line: 113)
!2677 = !DISubprogram(name: "isspace", linkageName: "_Z7isspacei", scope: !2659, file: !2659, line: 267, type: !2651, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2678 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2679, line: 114)
!2679 = !DISubprogram(name: "isupper", linkageName: "_Z7isupperi", scope: !2659, file: !2659, line: 273, type: !2651, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2680 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2681, line: 115)
!2681 = !DISubprogram(name: "isxdigit", linkageName: "_Z8isxdigiti", scope: !2659, file: !2659, line: 280, type: !2651, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2682 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2683, line: 116)
!2683 = !DISubprogram(name: "tolower", linkageName: "_Z7toloweri", scope: !2659, file: !2659, line: 292, type: !2651, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2684 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2685, line: 117)
!2685 = !DISubprogram(name: "toupper", linkageName: "_Z7toupperi", scope: !2659, file: !2659, line: 298, type: !2651, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2686 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2687, line: 63)
!2687 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !2688, line: 31, baseType: !2689)
!2688 = !DIFile(filename: "/usr/include/sys/_types/_wint_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2689 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wint_t", file: !2120, line: 112, baseType: !133)
!2690 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2691, line: 64)
!2691 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctrans_t", file: !2692, line: 31, baseType: !2693)
!2692 = !DIFile(filename: "/usr/include/_types/_wctrans_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2693 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctrans_t", file: !2694, line: 40, baseType: !133)
!2694 = !DIFile(filename: "/usr/include/_types.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2696, line: 65)
!2696 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !2697, line: 31, baseType: !2698)
!2697 = !DIFile(filename: "/usr/include/_types/_wctype_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2698 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctype_t", file: !2694, line: 42, baseType: !2699)
!2699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !2120, line: 45, baseType: !659)
!2700 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2701, line: 66)
!2701 = !DISubprogram(name: "iswalnum", linkageName: "_Z8iswalnumi", scope: !2702, file: !2702, line: 66, type: !2703, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2702 = !DIFile(filename: "/usr/include/_wctype.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2703 = !DISubroutineType(types: !2704)
!2704 = !{!133, !2687}
!2705 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2706, line: 67)
!2706 = !DISubprogram(name: "iswalpha", linkageName: "_Z8iswalphai", scope: !2702, file: !2702, line: 72, type: !2703, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2707 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2708, line: 68)
!2708 = !DISubprogram(name: "iswblank", linkageName: "_Z8iswblanki", scope: !2709, file: !2709, line: 50, type: !2703, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2709 = !DIFile(filename: "/usr/include/wctype.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2710 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2711, line: 69)
!2711 = !DISubprogram(name: "iswcntrl", linkageName: "_Z8iswcntrli", scope: !2702, file: !2702, line: 78, type: !2703, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2712 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2713, line: 70)
!2713 = !DISubprogram(name: "iswdigit", linkageName: "_Z8iswdigiti", scope: !2702, file: !2702, line: 90, type: !2703, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2714 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2715, line: 71)
!2715 = !DISubprogram(name: "iswgraph", linkageName: "_Z8iswgraphi", scope: !2702, file: !2702, line: 96, type: !2703, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2716 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2717, line: 72)
!2717 = !DISubprogram(name: "iswlower", linkageName: "_Z8iswloweri", scope: !2702, file: !2702, line: 102, type: !2703, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2718 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2719, line: 73)
!2719 = !DISubprogram(name: "iswprint", linkageName: "_Z8iswprinti", scope: !2702, file: !2702, line: 108, type: !2703, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2720 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2721, line: 74)
!2721 = !DISubprogram(name: "iswpunct", linkageName: "_Z8iswpuncti", scope: !2702, file: !2702, line: 114, type: !2703, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2722 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2723, line: 75)
!2723 = !DISubprogram(name: "iswspace", linkageName: "_Z8iswspacei", scope: !2702, file: !2702, line: 120, type: !2703, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2724 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2725, line: 76)
!2725 = !DISubprogram(name: "iswupper", linkageName: "_Z8iswupperi", scope: !2702, file: !2702, line: 126, type: !2703, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2726 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2727, line: 77)
!2727 = !DISubprogram(name: "iswxdigit", linkageName: "_Z9iswxdigiti", scope: !2702, file: !2702, line: 132, type: !2703, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2728 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2729, line: 78)
!2729 = !DISubprogram(name: "iswctype", linkageName: "_Z8iswctypeij", scope: !2702, file: !2702, line: 84, type: !2730, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2730 = !DISubroutineType(types: !2731)
!2731 = !{!133, !2687, !2696}
!2732 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2733, line: 79)
!2733 = !DISubprogram(name: "wctype", scope: !2702, file: !2702, line: 172, type: !2734, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2734 = !DISubroutineType(types: !2735)
!2735 = !{!2696, !2142}
!2736 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2737, line: 80)
!2737 = !DISubprogram(name: "towlower", linkageName: "_Z8towloweri", scope: !2702, file: !2702, line: 138, type: !2738, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2738 = !DISubroutineType(types: !2739)
!2739 = !{!2687, !2687}
!2740 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2741, line: 81)
!2741 = !DISubprogram(name: "towupper", linkageName: "_Z8towupperi", scope: !2702, file: !2702, line: 144, type: !2738, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2742 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2743, line: 82)
!2743 = !DISubprogram(name: "towctrans", scope: !2709, file: !2709, line: 121, type: !2744, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2744 = !DISubroutineType(types: !2745)
!2745 = !{!2687, !2687, !2691}
!2746 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2747, line: 83)
!2747 = !DISubprogram(name: "wctrans", scope: !2709, file: !2709, line: 123, type: !2748, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2748 = !DISubroutineType(types: !2749)
!2749 = !{!2691, !2142}
!2750 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2751, line: 116)
!2751 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !2752, line: 31, baseType: !2753)
!2752 = !DIFile(filename: "/usr/include/sys/_types/_mbstate_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2753 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mbstate_t", file: !2120, line: 81, baseType: !2754)
!2754 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !2120, line: 79, baseType: !2755)
!2755 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !2120, line: 76, size: 1024, elements: !2756, identifier: "_ZTS11__mbstate_t")
!2756 = !{!2757, !2761}
!2757 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !2755, file: !2120, line: 77, baseType: !2758, size: 1024)
!2758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2141, size: 1024, elements: !2759)
!2759 = !{!2760}
!2760 = !DISubrange(count: 128)
!2761 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !2755, file: !2120, line: 78, baseType: !1127, size: 64)
!2762 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2117, line: 117)
!2763 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2764, line: 118)
!2764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !2765, line: 73, size: 448, elements: !2766, identifier: "_ZTS2tm")
!2765 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2766 = !{!2767, !2768, !2769, !2770, !2771, !2772, !2773, !2774, !2775, !2776, !2777}
!2767 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !2764, file: !2765, line: 74, baseType: !133, size: 32)
!2768 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !2764, file: !2765, line: 75, baseType: !133, size: 32, offset: 32)
!2769 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !2764, file: !2765, line: 76, baseType: !133, size: 32, offset: 64)
!2770 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !2764, file: !2765, line: 77, baseType: !133, size: 32, offset: 96)
!2771 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !2764, file: !2765, line: 78, baseType: !133, size: 32, offset: 128)
!2772 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !2764, file: !2765, line: 79, baseType: !133, size: 32, offset: 160)
!2773 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !2764, file: !2765, line: 80, baseType: !133, size: 32, offset: 192)
!2774 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !2764, file: !2765, line: 81, baseType: !133, size: 32, offset: 224)
!2775 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !2764, file: !2765, line: 82, baseType: !133, size: 32, offset: 256)
!2776 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !2764, file: !2765, line: 83, baseType: !815, size: 64, offset: 320)
!2777 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !2764, file: !2765, line: 84, baseType: !2140, size: 64, offset: 384)
!2778 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2687, line: 119)
!2779 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2441, line: 120)
!2780 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2781, line: 121)
!2781 = !DISubprogram(name: "fwprintf", scope: !2782, file: !2782, line: 103, type: !2783, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2782 = !DIFile(filename: "/usr/include/wchar.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/fetch_add")
!2783 = !DISubroutineType(types: !2784)
!2784 = !{!133, !2500, !2438, null}
!2785 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2786, line: 122)
!2786 = !DISubprogram(name: "fwscanf", scope: !2782, file: !2782, line: 104, type: !2783, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2787 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2788, line: 123)
!2788 = !DISubprogram(name: "swprintf", scope: !2782, file: !2782, line: 115, type: !2789, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2789 = !DISubroutineType(types: !2790)
!2790 = !{!133, !2425, !2117, !2438, null}
!2791 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2792, line: 124)
!2792 = !DISubprogram(name: "vfwprintf", scope: !2782, file: !2782, line: 118, type: !2793, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2793 = !DISubroutineType(types: !2794)
!2794 = !{!133, !2500, !2438, !2533}
!2795 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2796, line: 125)
!2796 = !DISubprogram(name: "vswprintf", scope: !2782, file: !2782, line: 120, type: !2797, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2797 = !DISubroutineType(types: !2798)
!2798 = !{!133, !2425, !2117, !2438, !2533}
!2799 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2800, line: 126)
!2800 = !DISubprogram(name: "swscanf", scope: !2782, file: !2782, line: 116, type: !2801, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2801 = !DISubroutineType(types: !2802)
!2802 = !{!133, !2438, !2438, null}
!2803 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2804, line: 127)
!2804 = !DISubprogram(name: "vfwscanf", scope: !2782, file: !2782, line: 170, type: !2793, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2805 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2806, line: 128)
!2806 = !DISubprogram(name: "vswscanf", scope: !2782, file: !2782, line: 172, type: !2807, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2807 = !DISubroutineType(types: !2808)
!2808 = !{!133, !2438, !2438, !2533}
!2809 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2810, line: 129)
!2810 = !DISubprogram(name: "fgetwc", scope: !2782, file: !2782, line: 98, type: !2811, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2811 = !DISubroutineType(types: !2812)
!2812 = !{!2687, !2500}
!2813 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2814, line: 130)
!2814 = !DISubprogram(name: "fgetws", scope: !2782, file: !2782, line: 99, type: !2815, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!2815 = !DISubroutineType(types: !2816)
!2816 = !{!2425, !2425, !133, !2500}
!2817 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !2818, line: 131)
