; ModuleID = 'main.bc'
source_filename = "main.cpp"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

@.str = private unnamed_addr constant [10 x i8] c"./example\00", align 1

; Function Attrs: norecurse ssp uwtable
define i32 @main() local_unnamed_addr #0 !dbg !947 {
entry:
  tail call void @checker_generateExecutor(), !dbg !948
  %call = tail call i32 @"\01_system"(i8* getelementptr inbounds ([10 x i8], [10 x i8]* @.str, i64 0, i64 0)), !dbg !949
  ret i32 0, !dbg !950
}

declare void @checker_generateExecutor() local_unnamed_addr #1

declare i32 @"\01_system"(i8*) local_unnamed_addr #1

attributes #0 = { norecurse ssp uwtable "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="true" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-jump-tables"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="core2" "target-features"="+cx16,+fxsr,+mmx,+sse,+sse2,+sse3,+ssse3,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }

!126 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!127 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !128, line: 161)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !129, line: 31, baseType: !130)
!129 = !DIFile(filename: "/usr/include/_types/_uint64_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!130 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!131 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !132, line: 163)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !133, line: 29, baseType: !101)
!133 = !DIFile(filename: "/usr/include/stdint.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!134 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !135, line: 164)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !133, line: 30, baseType: !105)
!136 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !137, line: 165)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !133, line: 31, baseType: !109)
!138 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !139, line: 166)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !133, line: 32, baseType: !112)
!140 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !141, line: 168)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !133, line: 33, baseType: !116)
!142 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !143, line: 169)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !133, line: 34, baseType: !120)
!144 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !145, line: 170)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !133, line: 35, baseType: !124)
!146 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !147, line: 171)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !133, line: 36, baseType: !128)
!148 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !149, line: 173)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !133, line: 40, baseType: !101)
!150 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !151, line: 174)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !133, line: 41, baseType: !105)
!152 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !153, line: 175)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !133, line: 42, baseType: !109)
!154 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !155, line: 176)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !133, line: 43, baseType: !112)
!156 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !157, line: 178)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !133, line: 44, baseType: !116)
!158 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !159, line: 179)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !133, line: 45, baseType: !120)
!160 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !161, line: 180)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !133, line: 46, baseType: !124)
!162 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !163, line: 181)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !133, line: 47, baseType: !128)
!164 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !165, line: 183)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !166, line: 30, baseType: !167)
!166 = !DIFile(filename: "/usr/include/sys/_types/_intptr_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !15, line: 49, baseType: !10)
!168 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !169, line: 184)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !170, line: 30, baseType: !16)
!170 = !DIFile(filename: "/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!171 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !172, line: 186)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !173, line: 32, baseType: !10)
!173 = !DIFile(filename: "/usr/include/_types/_intmax_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!174 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !175, line: 187)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !176, line: 32, baseType: !16)
!176 = !DIFile(filename: "/usr/include/_types/_uintmax_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!177 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !12, line: 100)
!178 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !179, line: 101)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !180, line: 85, baseType: !181)
!180 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 82, size: 64, elements: !182, identifier: "_ZTS5div_t")
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !181, file: !180, line: 83, baseType: !52, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !181, file: !180, line: 84, baseType: !52, size: 32, offset: 32)
!185 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !186, line: 102)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !180, line: 90, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 87, size: 128, elements: !188, identifier: "_ZTS6ldiv_t")
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !187, file: !180, line: 88, baseType: !10, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !187, file: !180, line: 89, baseType: !10, size: 64, offset: 64)
!191 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !192, line: 104)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !180, line: 96, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !180, line: 93, size: 128, elements: !194, identifier: "_ZTS7lldiv_t")
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !193, file: !180, line: 94, baseType: !114, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !193, file: !180, line: 95, baseType: !114, size: 64, offset: 64)
!197 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !198, line: 106)
!198 = !DISubprogram(name: "atof", scope: !180, file: !180, line: 131, type: !199, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!199 = !DISubroutineType(types: !200)
!200 = !{!201, !38}
!201 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!202 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !203, line: 107)
!203 = !DISubprogram(name: "atoi", scope: !180, file: !180, line: 132, type: !204, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!204 = !DISubroutineType(types: !205)
!205 = !{!52, !38}
!206 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !207, line: 108)
!207 = !DISubprogram(name: "atol", scope: !180, file: !180, line: 133, type: !208, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!208 = !DISubroutineType(types: !209)
!209 = !{!10, !38}
!210 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !211, line: 110)
!211 = !DISubprogram(name: "atoll", scope: !180, file: !180, line: 136, type: !212, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!212 = !DISubroutineType(types: !213)
!213 = !{!114, !38}
!214 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !215, line: 112)
!215 = !DISubprogram(name: "strtod", linkageName: "\01_strtod", scope: !180, file: !180, line: 162, type: !216, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!216 = !DISubroutineType(types: !217)
!217 = !{!201, !38, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!219 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !220, line: 113)
!220 = !DISubprogram(name: "strtof", linkageName: "\01_strtof", scope: !180, file: !180, line: 163, type: !221, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!221 = !DISubroutineType(types: !222)
!222 = !{!223, !38, !218}
!223 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!224 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !225, line: 114)
!225 = !DISubprogram(name: "strtold", scope: !180, file: !180, line: 166, type: !226, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!226 = !DISubroutineType(types: !227)
!227 = !{!20, !38, !218}
!228 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !229, line: 115)
!229 = !DISubprogram(name: "strtol", scope: !180, file: !180, line: 164, type: !230, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!230 = !DISubroutineType(types: !231)
!231 = !{!10, !38, !218, !52}
!232 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !233, line: 117)
!233 = !DISubprogram(name: "strtoll", scope: !180, file: !180, line: 169, type: !234, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!234 = !DISubroutineType(types: !235)
!235 = !{!114, !38, !218, !52}
!236 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !237, line: 119)
!237 = !DISubprogram(name: "strtoul", scope: !180, file: !180, line: 172, type: !238, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!238 = !DISubroutineType(types: !239)
!239 = !{!16, !38, !218, !52}
!240 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !241, line: 121)
!241 = !DISubprogram(name: "strtoull", scope: !180, file: !180, line: 175, type: !242, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!242 = !DISubroutineType(types: !243)
!243 = !{!130, !38, !218, !52}
!244 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !245, line: 123)
!245 = !DISubprogram(name: "rand", scope: !180, file: !180, line: 159, type: !246, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!246 = !DISubroutineType(types: !247)
!247 = !{!52}
!248 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !249, line: 124)
!249 = !DISubprogram(name: "srand", scope: !180, file: !180, line: 161, type: !250, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !126}
!252 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !253, line: 125)
!253 = !DISubprogram(name: "calloc", scope: !180, file: !180, line: 140, type: !254, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!254 = !DISubroutineType(types: !255)
!255 = !{!27, !12, !12}
!256 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !257, line: 126)
!257 = !DISubprogram(name: "free", scope: !180, file: !180, line: 143, type: !258, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !27}
!260 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !261, line: 127)
!261 = !DISubprogram(name: "malloc", scope: !180, file: !180, line: 152, type: !262, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!262 = !DISubroutineType(types: !263)
!263 = !{!27, !12}
!264 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !265, line: 128)
!265 = !DISubprogram(name: "realloc", scope: !180, file: !180, line: 160, type: !266, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!266 = !DISubroutineType(types: !267)
!267 = !{!27, !27, !12}
!268 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !269, line: 129)
!269 = !DISubprogram(name: "abort", scope: !180, file: !180, line: 128, type: !270, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!270 = !DISubroutineType(types: !271)
!271 = !{null}
!272 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !273, line: 130)
!273 = !DISubprogram(name: "atexit", scope: !180, file: !180, line: 130, type: !274, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!274 = !DISubroutineType(types: !275)
!275 = !{!52, !276}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!277 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !278, line: 131)
!278 = !DISubprogram(name: "exit", scope: !180, file: !180, line: 142, type: !279, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !52}
!281 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !282, line: 132)
!282 = !DISubprogram(name: "_Exit", scope: !180, file: !180, line: 182, type: !279, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!283 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !284, line: 134)
!284 = !DISubprogram(name: "getenv", scope: !180, file: !180, line: 144, type: !285, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!285 = !DISubroutineType(types: !286)
!286 = !{!36, !38}
!287 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !288, line: 135)
!288 = !DISubprogram(name: "system", linkageName: "\01_system", scope: !180, file: !180, line: 177, type: !204, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!289 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !290, line: 137)
!290 = !DISubprogram(name: "bsearch", scope: !180, file: !180, line: 138, type: !291, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!291 = !DISubroutineType(types: !292)
!292 = !{!27, !28, !28, !12, !12, !293}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{!52, !28, !28}
!296 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !297, line: 138)
!297 = !DISubprogram(name: "qsort", scope: !180, file: !180, line: 157, type: !298, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !27, !12, !12, !293}
!300 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !301, line: 139)
!301 = !DISubprogram(name: "abs", linkageName: "_Z3absx", scope: !302, file: !302, line: 113, type: !303, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!302 = !DIFile(filename: "/Users/aser/Documents/LLVM/llvm-4.0/build/bin/../include/c++/v1/stdlib.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!303 = !DISubroutineType(types: !304)
!304 = !{!114, !114}
!305 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !306, line: 140)
!306 = !DISubprogram(name: "labs", scope: !180, file: !180, line: 145, type: !307, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!307 = !DISubroutineType(types: !308)
!308 = !{!10, !10}
!309 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !310, line: 142)
!310 = !DISubprogram(name: "llabs", scope: !180, file: !180, line: 149, type: !303, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!311 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !312, line: 144)
!312 = !DISubprogram(name: "div", linkageName: "_Z3divxx", scope: !302, file: !302, line: 118, type: !313, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!313 = !DISubroutineType(types: !314)
!314 = !{!192, !114, !114}
!315 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !316, line: 145)
!316 = !DISubprogram(name: "ldiv", scope: !180, file: !180, line: 146, type: !317, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!317 = !DISubroutineType(types: !318)
!318 = !{!186, !10, !10}
!319 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !320, line: 147)
!320 = !DISubprogram(name: "lldiv", scope: !180, file: !180, line: 150, type: !313, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !322, line: 149)
!322 = !DISubprogram(name: "mblen", scope: !180, file: !180, line: 153, type: !323, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!323 = !DISubroutineType(types: !324)
!324 = !{!52, !38, !12}
!325 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !326, line: 150)
!326 = !DISubprogram(name: "mbtowc", scope: !180, file: !180, line: 155, type: !327, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!327 = !DISubroutineType(types: !328)
!328 = !{!52, !329, !38, !12}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!331 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !332, line: 151)
!332 = !DISubprogram(name: "wctomb", scope: !180, file: !180, line: 179, type: !333, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!333 = !DISubroutineType(types: !334)
!334 = !{!52, !36, !330}
!335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !336, line: 152)
!336 = !DISubprogram(name: "mbstowcs", scope: !180, file: !180, line: 154, type: !337, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!337 = !DISubroutineType(types: !338)
!338 = !{!12, !329, !38, !12}
!339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !340, line: 153)
!340 = !DISubprogram(name: "wcstombs", scope: !180, file: !180, line: 178, type: !341, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!341 = !DISubroutineType(types: !342)
!342 = !{!12, !36, !343, !12}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !330)
!345 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !346, line: 108)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !347, line: 153, baseType: !348)
!347 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !347, line: 122, size: 1216, elements: !349, identifier: "_ZTS7__sFILE")
!349 = !{!350, !352, !353, !354, !355, !356, !361, !362, !363, !367, !371, !379, !383, !384, !387, !388, !392, !396, !397, !398}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !348, file: !347, line: 123, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !348, file: !347, line: 124, baseType: !52, size: 32, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !348, file: !347, line: 125, baseType: !52, size: 32, offset: 96)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !348, file: !347, line: 126, baseType: !107, size: 16, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !348, file: !347, line: 127, baseType: !107, size: 16, offset: 144)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !348, file: !347, line: 128, baseType: !357, size: 128, offset: 192)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !347, line: 88, size: 128, elements: !358, identifier: "_ZTS6__sbuf")
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !357, file: !347, line: 89, baseType: !351, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !357, file: !347, line: 90, baseType: !52, size: 32, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !348, file: !347, line: 129, baseType: !52, size: 32, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !348, file: !347, line: 132, baseType: !27, size: 64, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !348, file: !347, line: 133, baseType: !364, size: 64, offset: 448)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!52, !27}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !348, file: !347, line: 134, baseType: !368, size: 64, offset: 512)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!52, !27, !36, !52}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !348, file: !347, line: 135, baseType: !372, size: 64, offset: 576)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DISubroutineType(types: !374)
!374 = !{!375, !27, !375, !52}
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !347, line: 77, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !377, line: 71, baseType: !378)
!377 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !15, line: 46, baseType: !114)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !348, file: !347, line: 136, baseType: !380, size: 64, offset: 640)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!52, !27, !38, !52}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !348, file: !347, line: 139, baseType: !357, size: 128, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !348, file: !347, line: 140, baseType: !385, size: 64, offset: 832)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !347, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !348, file: !347, line: 141, baseType: !52, size: 32, offset: 896)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !348, file: !347, line: 144, baseType: !389, size: 24, offset: 928)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 24, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 3)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !348, file: !347, line: 145, baseType: !393, size: 8, offset: 952)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 8, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 1)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !348, file: !347, line: 148, baseType: !357, size: 128, offset: 960)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !348, file: !347, line: 151, baseType: !52, size: 32, offset: 1088)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !348, file: !347, line: 152, baseType: !375, size: 64, offset: 1152)
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !375, line: 109)
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !12, line: 110)
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !402, line: 112)
!402 = !DISubprogram(name: "fclose", scope: !347, file: !347, line: 232, type: !403, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!403 = !DISubroutineType(types: !404)
!404 = !{!52, !405}
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!406 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !407, line: 113)
!407 = !DISubprogram(name: "fflush", scope: !347, file: !347, line: 235, type: !403, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!408 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !409, line: 114)
!409 = !DISubprogram(name: "setbuf", scope: !347, file: !347, line: 267, type: !410, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !405, !36}
!412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !413, line: 115)
!413 = !DISubprogram(name: "setvbuf", scope: !347, file: !347, line: 268, type: !414, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!414 = !DISubroutineType(types: !415)
!415 = !{!52, !405, !36, !52, !12}
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !417, line: 116)
!417 = !DISubprogram(name: "fprintf", scope: !347, file: !347, line: 244, type: !418, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!418 = !DISubroutineType(types: !419)
!419 = !{!52, !405, !38, null}
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !421, line: 117)
!421 = !DISubprogram(name: "fscanf", scope: !347, file: !347, line: 250, type: !418, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !423, line: 118)
!423 = !DISubprogram(name: "snprintf", scope: !347, file: !347, line: 421, type: !424, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!424 = !DISubroutineType(types: !425)
!425 = !{!52, !36, !12, !38, null}
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !427, line: 119)
!427 = !DISubprogram(name: "sprintf", scope: !347, file: !347, line: 269, type: !428, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!428 = !DISubroutineType(types: !429)
!429 = !{!52, !36, !38, null}
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !431, line: 120)
!431 = !DISubprogram(name: "sscanf", scope: !347, file: !347, line: 270, type: !432, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!432 = !DISubroutineType(types: !433)
!433 = !{!52, !38, !38, null}
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !435, line: 121)
!435 = !DISubprogram(name: "vfprintf", scope: !347, file: !347, line: 278, type: !436, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!436 = !DISubroutineType(types: !437)
!437 = !{!52, !405, !38, !438}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !440, identifier: "_ZTS13__va_list_tag")
!440 = !{!441, !442, !443, !444}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !439, file: !1, baseType: !126, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !439, file: !1, baseType: !126, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !439, file: !1, baseType: !27, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !439, file: !1, baseType: !27, size: 64, offset: 128)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !446, line: 122)
!446 = !DISubprogram(name: "vfscanf", scope: !347, file: !347, line: 422, type: !436, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !448, line: 123)
!448 = !DISubprogram(name: "vsscanf", scope: !347, file: !347, line: 425, type: !449, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!449 = !DISubroutineType(types: !450)
!450 = !{!52, !38, !38, !438}
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !452, line: 124)
!452 = !DISubprogram(name: "vsnprintf", scope: !347, file: !347, line: 424, type: !453, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!453 = !DISubroutineType(types: !454)
!454 = !{!52, !36, !12, !38, !438}
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !456, line: 125)
!456 = !DISubprogram(name: "vsprintf", scope: !347, file: !347, line: 280, type: !457, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!457 = !DISubroutineType(types: !458)
!458 = !{!52, !36, !38, !438}
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !460, line: 126)
!460 = !DISubprogram(name: "fgetc", scope: !347, file: !347, line: 236, type: !403, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !462, line: 127)
!462 = !DISubprogram(name: "fgets", scope: !347, file: !347, line: 238, type: !463, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!463 = !DISubroutineType(types: !464)
!464 = !{!36, !36, !52, !405}
!465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !466, line: 128)
!466 = !DISubprogram(name: "fputc", scope: !347, file: !347, line: 245, type: !467, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!467 = !DISubroutineType(types: !468)
!468 = !{!52, !52, !405}
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !470, line: 129)
!470 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !347, file: !347, line: 246, type: !471, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!471 = !DISubroutineType(types: !472)
!472 = !{!52, !38, !405}
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !474, line: 130)
!474 = !DISubprogram(name: "getc", scope: !347, file: !347, line: 255, type: !403, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !476, line: 131)
!476 = !DISubprogram(name: "putc", scope: !347, file: !347, line: 260, type: !467, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !478, line: 132)
!478 = !DISubprogram(name: "ungetc", scope: !347, file: !347, line: 277, type: !467, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !480, line: 133)
!480 = !DISubprogram(name: "fread", scope: !347, file: !347, line: 247, type: !481, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!481 = !DISubroutineType(types: !482)
!482 = !{!12, !27, !12, !12, !405}
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !484, line: 134)
!484 = !DISubprogram(name: "fwrite", linkageName: "\01_fwrite", scope: !347, file: !347, line: 254, type: !485, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!485 = !DISubroutineType(types: !486)
!486 = !{!12, !28, !12, !12, !405}
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !488, line: 135)
!488 = !DISubprogram(name: "fgetpos", scope: !347, file: !347, line: 237, type: !489, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!489 = !DISubroutineType(types: !490)
!490 = !{!52, !405, !491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !493, line: 136)
!493 = !DISubprogram(name: "fseek", scope: !347, file: !347, line: 251, type: !494, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!494 = !DISubroutineType(types: !495)
!495 = !{!52, !405, !10, !52}
!496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !497, line: 137)
!497 = !DISubprogram(name: "fsetpos", scope: !347, file: !347, line: 252, type: !498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!498 = !DISubroutineType(types: !499)
!499 = !{!52, !405, !500}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !375)
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !503, line: 138)
!503 = !DISubprogram(name: "ftell", scope: !347, file: !347, line: 253, type: !504, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!504 = !DISubroutineType(types: !505)
!505 = !{!10, !405}
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !507, line: 139)
!507 = !DISubprogram(name: "rewind", scope: !347, file: !347, line: 265, type: !508, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !405}
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !511, line: 140)
!511 = !DISubprogram(name: "clearerr", scope: !347, file: !347, line: 231, type: !508, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !513, line: 141)
!513 = !DISubprogram(name: "feof", scope: !347, file: !347, line: 233, type: !403, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !515, line: 142)
!515 = !DISubprogram(name: "ferror", scope: !347, file: !347, line: 234, type: !403, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !517, line: 143)
!517 = !DISubprogram(name: "perror", scope: !347, file: !347, line: 258, type: !518, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !38}
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !521, line: 146)
!521 = !DISubprogram(name: "fopen", linkageName: "\01_fopen", scope: !347, file: !347, line: 242, type: !522, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!522 = !DISubroutineType(types: !523)
!523 = !{!405, !38, !38}
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !525, line: 147)
!525 = !DISubprogram(name: "freopen", linkageName: "\01_freopen", scope: !347, file: !347, line: 248, type: !526, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!526 = !DISubroutineType(types: !527)
!527 = !{!405, !38, !38, !405}
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !529, line: 148)
!529 = !DISubprogram(name: "remove", scope: !347, file: !347, line: 263, type: !204, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !531, line: 149)
!531 = !DISubprogram(name: "rename", scope: !347, file: !347, line: 264, type: !55, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !533, line: 150)
!533 = !DISubprogram(name: "tmpfile", scope: !347, file: !347, line: 271, type: !534, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!534 = !DISubroutineType(types: !535)
!535 = !{!405}
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !537, line: 151)
!537 = !DISubprogram(name: "tmpnam", scope: !347, file: !347, line: 276, type: !538, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!538 = !DISubroutineType(types: !539)
!539 = !{!36, !36}
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !541, line: 155)
!541 = !DISubprogram(name: "getchar", scope: !347, file: !347, line: 256, type: !246, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !543, line: 157)
!543 = !DISubprogram(name: "gets", scope: !347, file: !347, line: 257, type: !538, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !545, line: 159)
!545 = !DISubprogram(name: "scanf", scope: !347, file: !347, line: 266, type: !546, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!546 = !DISubroutineType(types: !547)
!547 = !{!52, !38, null}
!548 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !549, line: 160)
!549 = !DISubprogram(name: "vscanf", scope: !347, file: !347, line: 423, type: !550, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!550 = !DISubroutineType(types: !551)
!551 = !{!52, !38, !438}
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !553, line: 164)
!553 = !DISubprogram(name: "printf", scope: !347, file: !347, line: 259, type: !546, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !555, line: 165)
!555 = !DISubprogram(name: "putchar", scope: !347, file: !347, line: 261, type: !556, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!556 = !DISubroutineType(types: !557)
!557 = !{!52, !52}
!558 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !559, line: 166)
!559 = !DISubprogram(name: "puts", scope: !347, file: !347, line: 262, type: !204, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !561, line: 167)
!561 = !DISubprogram(name: "vprintf", scope: !347, file: !347, line: 279, type: !550, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !563, line: 104)
!563 = !DISubprogram(name: "isalnum", linkageName: "_Z7isalnumi", scope: !564, file: !564, line: 212, type: !556, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!564 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !566, line: 105)
!566 = !DISubprogram(name: "isalpha", linkageName: "_Z7isalphai", scope: !564, file: !564, line: 218, type: !556, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !568, line: 106)
!568 = !DISubprogram(name: "isblank", linkageName: "_Z7isblanki", scope: !564, file: !564, line: 224, type: !556, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !570, line: 107)
!570 = !DISubprogram(name: "iscntrl", linkageName: "_Z7iscntrli", scope: !564, file: !564, line: 230, type: !556, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !572, line: 108)
!572 = !DISubprogram(name: "isdigit", linkageName: "_Z7isdigiti", scope: !564, file: !564, line: 237, type: !556, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !574, line: 109)
!574 = !DISubprogram(name: "isgraph", linkageName: "_Z7isgraphi", scope: !564, file: !564, line: 243, type: !556, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !576, line: 110)
!576 = !DISubprogram(name: "islower", linkageName: "_Z7isloweri", scope: !564, file: !564, line: 249, type: !556, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !578, line: 111)
!578 = !DISubprogram(name: "isprint", linkageName: "_Z7isprinti", scope: !564, file: !564, line: 255, type: !556, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !580, line: 112)
!580 = !DISubprogram(name: "ispunct", linkageName: "_Z7ispuncti", scope: !564, file: !564, line: 261, type: !556, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !582, line: 113)
!582 = !DISubprogram(name: "isspace", linkageName: "_Z7isspacei", scope: !564, file: !564, line: 267, type: !556, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !584, line: 114)
!584 = !DISubprogram(name: "isupper", linkageName: "_Z7isupperi", scope: !564, file: !564, line: 273, type: !556, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!585 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !586, line: 115)
!586 = !DISubprogram(name: "isxdigit", linkageName: "_Z8isxdigiti", scope: !564, file: !564, line: 280, type: !556, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !588, line: 116)
!588 = !DISubprogram(name: "tolower", linkageName: "_Z7toloweri", scope: !564, file: !564, line: 292, type: !556, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !590, line: 117)
!590 = !DISubprogram(name: "toupper", linkageName: "_Z7toupperi", scope: !564, file: !564, line: 298, type: !556, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !592, line: 63)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !593, line: 31, baseType: !594)
!593 = !DIFile(filename: "/usr/include/sys/_types/_wint_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wint_t", file: !15, line: 112, baseType: !52)
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !596, line: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctrans_t", file: !597, line: 31, baseType: !598)
!597 = !DIFile(filename: "/usr/include/_types/_wctrans_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctrans_t", file: !599, line: 40, baseType: !52)
!599 = !DIFile(filename: "/usr/include/_types.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !601, line: 65)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !602, line: 31, baseType: !603)
!602 = !DIFile(filename: "/usr/include/_types/_wctype_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctype_t", file: !599, line: 42, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !15, line: 45, baseType: !126)
!605 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !606, line: 66)
!606 = !DISubprogram(name: "iswalnum", linkageName: "_Z8iswalnumi", scope: !607, file: !607, line: 66, type: !608, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!607 = !DIFile(filename: "/usr/include/_wctype.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!608 = !DISubroutineType(types: !609)
!609 = !{!52, !592}
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !611, line: 67)
!611 = !DISubprogram(name: "iswalpha", linkageName: "_Z8iswalphai", scope: !607, file: !607, line: 72, type: !608, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!612 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !613, line: 68)
!613 = !DISubprogram(name: "iswblank", linkageName: "_Z8iswblanki", scope: !614, file: !614, line: 50, type: !608, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!614 = !DIFile(filename: "/usr/include/wctype.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!615 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !616, line: 69)
!616 = !DISubprogram(name: "iswcntrl", linkageName: "_Z8iswcntrli", scope: !607, file: !607, line: 78, type: !608, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !618, line: 70)
!618 = !DISubprogram(name: "iswdigit", linkageName: "_Z8iswdigiti", scope: !607, file: !607, line: 90, type: !608, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !620, line: 71)
!620 = !DISubprogram(name: "iswgraph", linkageName: "_Z8iswgraphi", scope: !607, file: !607, line: 96, type: !608, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !622, line: 72)
!622 = !DISubprogram(name: "iswlower", linkageName: "_Z8iswloweri", scope: !607, file: !607, line: 102, type: !608, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !624, line: 73)
!624 = !DISubprogram(name: "iswprint", linkageName: "_Z8iswprinti", scope: !607, file: !607, line: 108, type: !608, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !626, line: 74)
!626 = !DISubprogram(name: "iswpunct", linkageName: "_Z8iswpuncti", scope: !607, file: !607, line: 114, type: !608, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !628, line: 75)
!628 = !DISubprogram(name: "iswspace", linkageName: "_Z8iswspacei", scope: !607, file: !607, line: 120, type: !608, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !630, line: 76)
!630 = !DISubprogram(name: "iswupper", linkageName: "_Z8iswupperi", scope: !607, file: !607, line: 126, type: !608, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !632, line: 77)
!632 = !DISubprogram(name: "iswxdigit", linkageName: "_Z9iswxdigiti", scope: !607, file: !607, line: 132, type: !608, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !634, line: 78)
!634 = !DISubprogram(name: "iswctype", linkageName: "_Z8iswctypeij", scope: !607, file: !607, line: 84, type: !635, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!635 = !DISubroutineType(types: !636)
!636 = !{!52, !592, !601}
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !638, line: 79)
!638 = !DISubprogram(name: "wctype", scope: !607, file: !607, line: 172, type: !639, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!639 = !DISubroutineType(types: !640)
!640 = !{!601, !38}
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !642, line: 80)
!642 = !DISubprogram(name: "towlower", linkageName: "_Z8towloweri", scope: !607, file: !607, line: 138, type: !643, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!643 = !DISubroutineType(types: !644)
!644 = !{!592, !592}
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !646, line: 81)
!646 = !DISubprogram(name: "towupper", linkageName: "_Z8towupperi", scope: !607, file: !607, line: 144, type: !643, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !648, line: 82)
!648 = !DISubprogram(name: "towctrans", scope: !614, file: !614, line: 121, type: !649, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!649 = !DISubroutineType(types: !650)
!650 = !{!592, !592, !596}
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !652, line: 83)
!652 = !DISubprogram(name: "wctrans", scope: !614, file: !614, line: 123, type: !653, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!653 = !DISubroutineType(types: !654)
!654 = !{!596, !38}
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !656, line: 116)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !657, line: 31, baseType: !658)
!657 = !DIFile(filename: "/usr/include/sys/_types/_mbstate_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mbstate_t", file: !15, line: 81, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !15, line: 79, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !15, line: 76, size: 1024, elements: !661, identifier: "_ZTS11__mbstate_t")
!661 = !{!662, !666}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !660, file: !15, line: 77, baseType: !663, size: 1024)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 1024, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !660, file: !15, line: 78, baseType: !114, size: 64)
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !12, line: 117)
!668 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !669, line: 118)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !670, line: 73, size: 448, elements: !671, identifier: "_ZTS2tm")
!670 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!671 = !{!672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !669, file: !670, line: 74, baseType: !52, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !669, file: !670, line: 75, baseType: !52, size: 32, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !669, file: !670, line: 76, baseType: !52, size: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !669, file: !670, line: 77, baseType: !52, size: 32, offset: 96)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !669, file: !670, line: 78, baseType: !52, size: 32, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !669, file: !670, line: 79, baseType: !52, size: 32, offset: 160)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !669, file: !670, line: 80, baseType: !52, size: 32, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !669, file: !670, line: 81, baseType: !52, size: 32, offset: 224)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !669, file: !670, line: 82, baseType: !52, size: 32, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !669, file: !670, line: 83, baseType: !10, size: 64, offset: 320)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !669, file: !670, line: 84, baseType: !36, size: 64, offset: 384)
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !592, line: 119)
!684 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !346, line: 120)
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !686, line: 121)
!686 = !DISubprogram(name: "fwprintf", scope: !687, file: !687, line: 103, type: !688, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!687 = !DIFile(filename: "/usr/include/wchar.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!688 = !DISubroutineType(types: !689)
!689 = !{!52, !405, !343, null}
!690 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !691, line: 122)
!691 = !DISubprogram(name: "fwscanf", scope: !687, file: !687, line: 104, type: !688, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!692 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !693, line: 123)
!693 = !DISubprogram(name: "swprintf", scope: !687, file: !687, line: 115, type: !694, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!694 = !DISubroutineType(types: !695)
!695 = !{!52, !329, !12, !343, null}
!696 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !697, line: 124)
!697 = !DISubprogram(name: "vfwprintf", scope: !687, file: !687, line: 118, type: !698, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!698 = !DISubroutineType(types: !699)
!699 = !{!52, !405, !343, !438}
!700 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !701, line: 125)
!701 = !DISubprogram(name: "vswprintf", scope: !687, file: !687, line: 120, type: !702, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!702 = !DISubroutineType(types: !703)
!703 = !{!52, !329, !12, !343, !438}
!704 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !705, line: 126)
!705 = !DISubprogram(name: "swscanf", scope: !687, file: !687, line: 116, type: !706, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!706 = !DISubroutineType(types: !707)
!707 = !{!52, !343, !343, null}
!708 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !709, line: 127)
!709 = !DISubprogram(name: "vfwscanf", scope: !687, file: !687, line: 170, type: !698, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!710 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !711, line: 128)
!711 = !DISubprogram(name: "vswscanf", scope: !687, file: !687, line: 172, type: !712, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!712 = !DISubroutineType(types: !713)
!713 = !{!52, !343, !343, !438}
!714 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !715, line: 129)
!715 = !DISubprogram(name: "fgetwc", scope: !687, file: !687, line: 98, type: !716, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!716 = !DISubroutineType(types: !717)
!717 = !{!592, !405}
!718 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !719, line: 130)
!719 = !DISubprogram(name: "fgetws", scope: !687, file: !687, line: 99, type: !720, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!720 = !DISubroutineType(types: !721)
!721 = !{!329, !329, !52, !405}
!722 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !723, line: 131)
!723 = !DISubprogram(name: "fputwc", scope: !687, file: !687, line: 100, type: !724, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!724 = !DISubroutineType(types: !725)
!725 = !{!592, !330, !405}
