; ModuleID = 'x.bc'
source_filename = "example.cpp"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

@data1 = local_unnamed_addr global i32 0, align 4, !dbg !0
@data2 = local_unnamed_addr global i32 0, align 4, !dbg !18
@data3 = local_unnamed_addr global i32 0, align 4, !dbg !21
@data4 = local_unnamed_addr global i32 0, align 4, !dbg !23
@x = global { i32 } zeroinitializer, align 4, !dbg !25
@y = global { i32 } zeroinitializer, align 4, !dbg !180
@.str = private unnamed_addr constant [3 x i8] c"f1\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"f2\00", align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"f3\00", align 1

; Function Attrs: ssp uwtable
define void @_Z2f1v() local_unnamed_addr #0 !dbg !1122 {
entry:
  tail call void @checker_thread_begin(i8* getelementptr inbounds ([3 x i8], [3 x i8]* @.str, i64 0, i64 0)), !dbg !1124
  tail call void @llvm.dbg.value(metadata i32 10, i64 0, metadata !1125, metadata !1131), !dbg !1132
  tail call void @llvm.dbg.value(metadata i32 3, i64 0, metadata !1130, metadata !1131), !dbg !1134
  %myCast = bitcast i32* getelementptr inbounds ({ i32 }, { i32 }* @x, i64 0, i32 0) to i8*
  call void @preAtomicStore_int(i8* %myCast, i32 10, i32 5)
  store atomic i32 10, i32* getelementptr inbounds ({ i32 }, { i32 }* @x, i64 0, i32 0) release, align 4, !dbg !1135
  tail call void @llvm.dbg.value(metadata i32 10, i64 0, metadata !1125, metadata !1131), !dbg !1137

!301 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!302 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !303, line: 161)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !304, line: 31, baseType: !305)
!304 = !DIFile(filename: "/usr/include/_types/_uint64_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!305 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!306 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !307, line: 163)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !308, line: 29, baseType: !276)
!308 = !DIFile(filename: "/usr/include/stdint.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!309 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !310, line: 164)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !308, line: 30, baseType: !280)
!311 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !312, line: 165)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !308, line: 31, baseType: !284)
!313 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !314, line: 166)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !308, line: 32, baseType: !287)
!315 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !316, line: 168)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !308, line: 33, baseType: !291)
!317 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !318, line: 169)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !308, line: 34, baseType: !295)
!319 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !320, line: 170)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !308, line: 35, baseType: !299)
!321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !322, line: 171)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !308, line: 36, baseType: !303)
!323 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !324, line: 173)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !308, line: 40, baseType: !276)
!325 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !326, line: 174)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !308, line: 41, baseType: !280)
!327 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !328, line: 175)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !308, line: 42, baseType: !284)
!329 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !330, line: 176)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !308, line: 43, baseType: !287)
!331 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !332, line: 178)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !308, line: 44, baseType: !291)
!333 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !334, line: 179)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !308, line: 45, baseType: !295)
!335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !336, line: 180)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !308, line: 46, baseType: !299)
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !338, line: 181)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !308, line: 47, baseType: !303)
!339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !340, line: 183)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !341, line: 30, baseType: !342)
!341 = !DIFile(filename: "/usr/include/sys/_types/_intptr_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !191, line: 49, baseType: !186)
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !344, line: 184)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !345, line: 30, baseType: !192)
!345 = !DIFile(filename: "/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !347, line: 186)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !348, line: 32, baseType: !186)
!348 = !DIFile(filename: "/usr/include/_types/_intmax_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!349 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !350, line: 187)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !351, line: 32, baseType: !192)
!351 = !DIFile(filename: "/usr/include/_types/_uintmax_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !188, line: 100)
!353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !354, line: 101)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !355, line: 85, baseType: !356)
!355 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !355, line: 82, size: 64, elements: !357, identifier: "_ZTS5div_t")
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !356, file: !355, line: 83, baseType: !20, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !356, file: !355, line: 84, baseType: !20, size: 32, offset: 32)
!360 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !361, line: 102)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !355, line: 90, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !355, line: 87, size: 128, elements: !363, identifier: "_ZTS6ldiv_t")
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !362, file: !355, line: 88, baseType: !186, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !362, file: !355, line: 89, baseType: !186, size: 64, offset: 64)
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !367, line: 104)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !355, line: 96, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !355, line: 93, size: 128, elements: !369, identifier: "_ZTS7lldiv_t")
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !368, file: !355, line: 94, baseType: !289, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !368, file: !355, line: 95, baseType: !289, size: 64, offset: 64)
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !373, line: 106)
!373 = !DISubprogram(name: "atof", scope: !355, file: !355, line: 131, type: !374, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!374 = !DISubroutineType(types: !375)
!375 = !{!376, !214}
!376 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!377 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !378, line: 107)
!378 = !DISubprogram(name: "atoi", scope: !355, file: !355, line: 132, type: !379, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!379 = !DISubroutineType(types: !380)
!380 = !{!20, !214}
!381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !382, line: 108)
!382 = !DISubprogram(name: "atol", scope: !355, file: !355, line: 133, type: !383, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!383 = !DISubroutineType(types: !384)
!384 = !{!186, !214}
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !386, line: 110)
!386 = !DISubprogram(name: "atoll", scope: !355, file: !355, line: 136, type: !387, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!387 = !DISubroutineType(types: !388)
!388 = !{!289, !214}
!389 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !390, line: 112)
!390 = !DISubprogram(name: "strtod", linkageName: "\01_strtod", scope: !355, file: !355, line: 162, type: !391, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!391 = !DISubroutineType(types: !392)
!392 = !{!376, !214, !393}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!394 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !395, line: 113)
!395 = !DISubprogram(name: "strtof", linkageName: "\01_strtof", scope: !355, file: !355, line: 163, type: !396, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!396 = !DISubroutineType(types: !397)
!397 = !{!398, !214, !393}
!398 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !400, line: 114)
!400 = !DISubprogram(name: "strtold", scope: !355, file: !355, line: 166, type: !401, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!401 = !DISubroutineType(types: !402)
!402 = !{!196, !214, !393}
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !404, line: 115)
!404 = !DISubprogram(name: "strtol", scope: !355, file: !355, line: 164, type: !405, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!405 = !DISubroutineType(types: !406)
!406 = !{!186, !214, !393, !20}
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !408, line: 117)
!408 = !DISubprogram(name: "strtoll", scope: !355, file: !355, line: 169, type: !409, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!409 = !DISubroutineType(types: !410)
!410 = !{!289, !214, !393, !20}
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !412, line: 119)
!412 = !DISubprogram(name: "strtoul", scope: !355, file: !355, line: 172, type: !413, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!413 = !DISubroutineType(types: !414)
!414 = !{!192, !214, !393, !20}
!415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !416, line: 121)
!416 = !DISubprogram(name: "strtoull", scope: !355, file: !355, line: 175, type: !417, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!417 = !DISubroutineType(types: !418)
!418 = !{!305, !214, !393, !20}
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !420, line: 123)
!420 = !DISubprogram(name: "rand", scope: !355, file: !355, line: 159, type: !421, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!421 = !DISubroutineType(types: !422)
!422 = !{!20}
!423 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !424, line: 124)
!424 = !DISubprogram(name: "srand", scope: !355, file: !355, line: 161, type: !425, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !301}
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !428, line: 125)
!428 = !DISubprogram(name: "calloc", scope: !355, file: !355, line: 140, type: !429, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!429 = !DISubroutineType(types: !430)
!430 = !{!203, !188, !188}
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !432, line: 126)
!432 = !DISubprogram(name: "free", scope: !355, file: !355, line: 143, type: !433, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !203}
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !436, line: 127)
!436 = !DISubprogram(name: "malloc", scope: !355, file: !355, line: 152, type: !437, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!437 = !DISubroutineType(types: !438)
!438 = !{!203, !188}
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !440, line: 128)
!440 = !DISubprogram(name: "realloc", scope: !355, file: !355, line: 160, type: !441, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!441 = !DISubroutineType(types: !442)
!442 = !{!203, !203, !188}
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !444, line: 129)
!444 = !DISubprogram(name: "abort", scope: !355, file: !355, line: 128, type: !445, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!445 = !DISubroutineType(types: !446)
!446 = !{null}
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !448, line: 130)
!448 = !DISubprogram(name: "atexit", scope: !355, file: !355, line: 130, type: !449, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!449 = !DISubroutineType(types: !450)
!450 = !{!20, !451}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !453, line: 131)
!453 = !DISubprogram(name: "exit", scope: !355, file: !355, line: 142, type: !454, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !20}
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !457, line: 132)
!457 = !DISubprogram(name: "_Exit", scope: !355, file: !355, line: 182, type: !454, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !459, line: 134)
!459 = !DISubprogram(name: "getenv", scope: !355, file: !355, line: 144, type: !460, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!460 = !DISubroutineType(types: !461)
!461 = !{!212, !214}
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !463, line: 135)
!463 = !DISubprogram(name: "system", linkageName: "\01_system", scope: !355, file: !355, line: 177, type: !379, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !465, line: 137)
!465 = !DISubprogram(name: "bsearch", scope: !355, file: !355, line: 138, type: !466, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!466 = !DISubroutineType(types: !467)
!467 = !{!203, !204, !204, !188, !188, !468}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DISubroutineType(types: !470)
!470 = !{!20, !204, !204}
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !472, line: 138)
!472 = !DISubprogram(name: "qsort", scope: !355, file: !355, line: 157, type: !473, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !203, !188, !188, !468}
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !476, line: 139)
!476 = !DISubprogram(name: "abs", linkageName: "_Z3absx", scope: !477, file: !477, line: 113, type: !478, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!477 = !DIFile(filename: "/Users/aser/Documents/LLVM/llvm-4.0/build/bin/../include/c++/v1/stdlib.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!478 = !DISubroutineType(types: !479)
!479 = !{!289, !289}
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !481, line: 140)
!481 = !DISubprogram(name: "labs", scope: !355, file: !355, line: 145, type: !482, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!482 = !DISubroutineType(types: !483)
!483 = !{!186, !186}
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !485, line: 142)
!485 = !DISubprogram(name: "llabs", scope: !355, file: !355, line: 149, type: !478, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !487, line: 144)
!487 = !DISubprogram(name: "div", linkageName: "_Z3divxx", scope: !477, file: !477, line: 118, type: !488, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!488 = !DISubroutineType(types: !489)
!489 = !{!367, !289, !289}
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !491, line: 145)
!491 = !DISubprogram(name: "ldiv", scope: !355, file: !355, line: 146, type: !492, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!492 = !DISubroutineType(types: !493)
!493 = !{!361, !186, !186}
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !495, line: 147)
!495 = !DISubprogram(name: "lldiv", scope: !355, file: !355, line: 150, type: !488, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!496 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !497, line: 149)
!497 = !DISubprogram(name: "mblen", scope: !355, file: !355, line: 153, type: !498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!498 = !DISubroutineType(types: !499)
!499 = !{!20, !214, !188}
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !501, line: 150)
!501 = !DISubprogram(name: "mbtowc", scope: !355, file: !355, line: 155, type: !502, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!502 = !DISubroutineType(types: !503)
!503 = !{!20, !504, !214, !188}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !507, line: 151)
!507 = !DISubprogram(name: "wctomb", scope: !355, file: !355, line: 179, type: !508, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!508 = !DISubroutineType(types: !509)
!509 = !{!20, !212, !505}
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !511, line: 152)
!511 = !DISubprogram(name: "mbstowcs", scope: !355, file: !355, line: 154, type: !512, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!512 = !DISubroutineType(types: !513)
!513 = !{!188, !504, !214, !188}
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !515, line: 153)
!515 = !DISubprogram(name: "wcstombs", scope: !355, file: !355, line: 178, type: !516, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!516 = !DISubroutineType(types: !517)
!517 = !{!188, !212, !518, !188}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !505)
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !521, line: 108)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !522, line: 153, baseType: !523)
!522 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !522, line: 122, size: 1216, elements: !524, identifier: "_ZTS7__sFILE")
!524 = !{!525, !527, !528, !529, !530, !531, !536, !537, !538, !542, !546, !554, !558, !559, !562, !563, !567, !571, !572, !573}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !523, file: !522, line: 123, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !523, file: !522, line: 124, baseType: !20, size: 32, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !523, file: !522, line: 125, baseType: !20, size: 32, offset: 96)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !523, file: !522, line: 126, baseType: !282, size: 16, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !523, file: !522, line: 127, baseType: !282, size: 16, offset: 144)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !523, file: !522, line: 128, baseType: !532, size: 128, offset: 192)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !522, line: 88, size: 128, elements: !533, identifier: "_ZTS6__sbuf")
!533 = !{!534, !535}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !532, file: !522, line: 89, baseType: !526, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !532, file: !522, line: 90, baseType: !20, size: 32, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !523, file: !522, line: 129, baseType: !20, size: 32, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !523, file: !522, line: 132, baseType: !203, size: 64, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !523, file: !522, line: 133, baseType: !539, size: 64, offset: 448)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{!20, !203}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !523, file: !522, line: 134, baseType: !543, size: 64, offset: 512)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DISubroutineType(types: !545)
!545 = !{!20, !203, !212, !20}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !523, file: !522, line: 135, baseType: !547, size: 64, offset: 576)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{!550, !203, !550, !20}
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !522, line: 77, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !552, line: 71, baseType: !553)
!552 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !191, line: 46, baseType: !289)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !523, file: !522, line: 136, baseType: !555, size: 64, offset: 640)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!20, !203, !214, !20}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !523, file: !522, line: 139, baseType: !532, size: 128, offset: 704)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !523, file: !522, line: 140, baseType: !560, size: 64, offset: 832)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !522, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !523, file: !522, line: 141, baseType: !20, size: 32, offset: 896)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !523, file: !522, line: 144, baseType: !564, size: 24, offset: 928)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 24, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 3)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !523, file: !522, line: 145, baseType: !568, size: 8, offset: 952)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 8, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 1)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !523, file: !522, line: 148, baseType: !532, size: 128, offset: 960)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !523, file: !522, line: 151, baseType: !20, size: 32, offset: 1088)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !523, file: !522, line: 152, baseType: !550, size: 64, offset: 1152)
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !550, line: 109)
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !188, line: 110)
!576 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !577, line: 112)
!577 = !DISubprogram(name: "fclose", scope: !522, file: !522, line: 232, type: !578, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!578 = !DISubroutineType(types: !579)
!579 = !{!20, !580}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !582, line: 113)
!582 = !DISubprogram(name: "fflush", scope: !522, file: !522, line: 235, type: !578, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !584, line: 114)
!584 = !DISubprogram(name: "setbuf", scope: !522, file: !522, line: 267, type: !585, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !580, !212}
!587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !588, line: 115)
!588 = !DISubprogram(name: "setvbuf", scope: !522, file: !522, line: 268, type: !589, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!589 = !DISubroutineType(types: !590)
!590 = !{!20, !580, !212, !20, !188}
!591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !592, line: 116)
!592 = !DISubprogram(name: "fprintf", scope: !522, file: !522, line: 244, type: !593, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!593 = !DISubroutineType(types: !594)
!594 = !{!20, !580, !214, null}
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !596, line: 117)
!596 = !DISubprogram(name: "fscanf", scope: !522, file: !522, line: 250, type: !593, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !598, line: 118)
!598 = !DISubprogram(name: "snprintf", scope: !522, file: !522, line: 421, type: !599, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!599 = !DISubroutineType(types: !600)
!600 = !{!20, !212, !188, !214, null}
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !602, line: 119)
!602 = !DISubprogram(name: "sprintf", scope: !522, file: !522, line: 269, type: !603, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!603 = !DISubroutineType(types: !604)
!604 = !{!20, !212, !214, null}
!605 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !606, line: 120)
!606 = !DISubprogram(name: "sscanf", scope: !522, file: !522, line: 270, type: !607, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!607 = !DISubroutineType(types: !608)
!608 = !{!20, !214, !214, null}
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !610, line: 121)
!610 = !DISubprogram(name: "vfprintf", scope: !522, file: !522, line: 278, type: !611, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!611 = !DISubroutineType(types: !612)
!612 = !{!20, !580, !214, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !615, identifier: "_ZTS13__va_list_tag")
!615 = !{!616, !617, !618, !619}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !614, file: !3, baseType: !301, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !614, file: !3, baseType: !301, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !614, file: !3, baseType: !203, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !614, file: !3, baseType: !203, size: 64, offset: 128)
!620 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !621, line: 122)
!621 = !DISubprogram(name: "vfscanf", scope: !522, file: !522, line: 422, type: !611, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !623, line: 123)
!623 = !DISubprogram(name: "vsscanf", scope: !522, file: !522, line: 425, type: !624, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!624 = !DISubroutineType(types: !625)
!625 = !{!20, !214, !214, !613}
!626 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !627, line: 124)
!627 = !DISubprogram(name: "vsnprintf", scope: !522, file: !522, line: 424, type: !628, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!628 = !DISubroutineType(types: !629)
!629 = !{!20, !212, !188, !214, !613}
!630 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !631, line: 125)
!631 = !DISubprogram(name: "vsprintf", scope: !522, file: !522, line: 280, type: !632, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!632 = !DISubroutineType(types: !633)
!633 = !{!20, !212, !214, !613}
!634 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !635, line: 126)
!635 = !DISubprogram(name: "fgetc", scope: !522, file: !522, line: 236, type: !578, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!636 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !637, line: 127)
!637 = !DISubprogram(name: "fgets", scope: !522, file: !522, line: 238, type: !638, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!638 = !DISubroutineType(types: !639)
!639 = !{!212, !212, !20, !580}
!640 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !641, line: 128)
!641 = !DISubprogram(name: "fputc", scope: !522, file: !522, line: 245, type: !642, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!642 = !DISubroutineType(types: !643)
!643 = !{!20, !20, !580}
!644 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !645, line: 129)
!645 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !522, file: !522, line: 246, type: !646, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!646 = !DISubroutineType(types: !647)
!647 = !{!20, !214, !580}
!648 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !649, line: 130)
!649 = !DISubprogram(name: "getc", scope: !522, file: !522, line: 255, type: !578, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!650 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !651, line: 131)
!651 = !DISubprogram(name: "putc", scope: !522, file: !522, line: 260, type: !642, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!652 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !653, line: 132)
!653 = !DISubprogram(name: "ungetc", scope: !522, file: !522, line: 277, type: !642, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!654 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !655, line: 133)
!655 = !DISubprogram(name: "fread", scope: !522, file: !522, line: 247, type: !656, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!656 = !DISubroutineType(types: !657)
!657 = !{!188, !203, !188, !188, !580}
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !659, line: 134)
!659 = !DISubprogram(name: "fwrite", linkageName: "\01_fwrite", scope: !522, file: !522, line: 254, type: !660, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!660 = !DISubroutineType(types: !661)
!661 = !{!188, !204, !188, !188, !580}
!662 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !663, line: 135)
!663 = !DISubprogram(name: "fgetpos", scope: !522, file: !522, line: 237, type: !664, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!664 = !DISubroutineType(types: !665)
!665 = !{!20, !580, !666}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !668, line: 136)
!668 = !DISubprogram(name: "fseek", scope: !522, file: !522, line: 251, type: !669, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!669 = !DISubroutineType(types: !670)
!670 = !{!20, !580, !186, !20}
!671 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !672, line: 137)
!672 = !DISubprogram(name: "fsetpos", scope: !522, file: !522, line: 252, type: !673, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!673 = !DISubroutineType(types: !674)
!674 = !{!20, !580, !675}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !550)
!677 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !678, line: 138)
!678 = !DISubprogram(name: "ftell", scope: !522, file: !522, line: 253, type: !679, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!679 = !DISubroutineType(types: !680)
!680 = !{!186, !580}
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !682, line: 139)
!682 = !DISubprogram(name: "rewind", scope: !522, file: !522, line: 265, type: !683, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !580}
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !686, line: 140)
!686 = !DISubprogram(name: "clearerr", scope: !522, file: !522, line: 231, type: !683, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!687 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !688, line: 141)
!688 = !DISubprogram(name: "feof", scope: !522, file: !522, line: 233, type: !578, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !690, line: 142)
!690 = !DISubprogram(name: "ferror", scope: !522, file: !522, line: 234, type: !578, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!691 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !692, line: 143)
!692 = !DISubprogram(name: "perror", scope: !522, file: !522, line: 258, type: !693, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !214}
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !696, line: 146)
!696 = !DISubprogram(name: "fopen", linkageName: "\01_fopen", scope: !522, file: !522, line: 242, type: !697, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!697 = !DISubroutineType(types: !698)
!698 = !{!580, !214, !214}
!699 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !700, line: 147)
!700 = !DISubprogram(name: "freopen", linkageName: "\01_freopen", scope: !522, file: !522, line: 248, type: !701, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!701 = !DISubroutineType(types: !702)
!702 = !{!580, !214, !214, !580}
!703 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !704, line: 148)
!704 = !DISubprogram(name: "remove", scope: !522, file: !522, line: 263, type: !379, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!705 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !706, line: 149)
!706 = !DISubprogram(name: "rename", scope: !522, file: !522, line: 264, type: !230, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!707 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !708, line: 150)
!708 = !DISubprogram(name: "tmpfile", scope: !522, file: !522, line: 271, type: !709, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!709 = !DISubroutineType(types: !710)
!710 = !{!580}
!711 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !712, line: 151)
!712 = !DISubprogram(name: "tmpnam", scope: !522, file: !522, line: 276, type: !713, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!713 = !DISubroutineType(types: !714)
!714 = !{!212, !212}
!715 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !716, line: 155)
!716 = !DISubprogram(name: "getchar", scope: !522, file: !522, line: 256, type: !421, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!717 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !718, line: 157)
!718 = !DISubprogram(name: "gets", scope: !522, file: !522, line: 257, type: !713, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !720, line: 159)
!720 = !DISubprogram(name: "scanf", scope: !522, file: !522, line: 266, type: !721, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!721 = !DISubroutineType(types: !722)
!722 = !{!20, !214, null}
!723 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !724, line: 160)
!724 = !DISubprogram(name: "vscanf", scope: !522, file: !522, line: 423, type: !725, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!725 = !DISubroutineType(types: !726)
!726 = !{!20, !214, !613}
!727 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !728, line: 164)
!728 = !DISubprogram(name: "printf", scope: !522, file: !522, line: 259, type: !721, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!729 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !730, line: 165)
!730 = !DISubprogram(name: "putchar", scope: !522, file: !522, line: 261, type: !731, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!731 = !DISubroutineType(types: !732)
!732 = !{!20, !20}
!733 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !734, line: 166)
!734 = !DISubprogram(name: "puts", scope: !522, file: !522, line: 262, type: !379, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!735 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !736, line: 167)
!736 = !DISubprogram(name: "vprintf", scope: !522, file: !522, line: 279, type: !725, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!737 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !738, line: 104)
!738 = !DISubprogram(name: "isalnum", linkageName: "_Z7isalnumi", scope: !739, file: !739, line: 212, type: !731, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!739 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!740 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !741, line: 105)
!741 = !DISubprogram(name: "isalpha", linkageName: "_Z7isalphai", scope: !739, file: !739, line: 218, type: !731, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!742 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !743, line: 106)
!743 = !DISubprogram(name: "isblank", linkageName: "_Z7isblanki", scope: !739, file: !739, line: 224, type: !731, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!744 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !745, line: 107)
!745 = !DISubprogram(name: "iscntrl", linkageName: "_Z7iscntrli", scope: !739, file: !739, line: 230, type: !731, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!746 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !747, line: 108)
!747 = !DISubprogram(name: "isdigit", linkageName: "_Z7isdigiti", scope: !739, file: !739, line: 237, type: !731, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!748 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !749, line: 109)
!749 = !DISubprogram(name: "isgraph", linkageName: "_Z7isgraphi", scope: !739, file: !739, line: 243, type: !731, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!750 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !751, line: 110)
!751 = !DISubprogram(name: "islower", linkageName: "_Z7isloweri", scope: !739, file: !739, line: 249, type: !731, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!752 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !753, line: 111)
!753 = !DISubprogram(name: "isprint", linkageName: "_Z7isprinti", scope: !739, file: !739, line: 255, type: !731, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!754 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !755, line: 112)
!755 = !DISubprogram(name: "ispunct", linkageName: "_Z7ispuncti", scope: !739, file: !739, line: 261, type: !731, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!756 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !757, line: 113)
!757 = !DISubprogram(name: "isspace", linkageName: "_Z7isspacei", scope: !739, file: !739, line: 267, type: !731, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!758 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !759, line: 114)
!759 = !DISubprogram(name: "isupper", linkageName: "_Z7isupperi", scope: !739, file: !739, line: 273, type: !731, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!760 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !761, line: 115)
!761 = !DISubprogram(name: "isxdigit", linkageName: "_Z8isxdigiti", scope: !739, file: !739, line: 280, type: !731, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!762 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !763, line: 116)
!763 = !DISubprogram(name: "tolower", linkageName: "_Z7toloweri", scope: !739, file: !739, line: 292, type: !731, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!764 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !765, line: 117)
!765 = !DISubprogram(name: "toupper", linkageName: "_Z7toupperi", scope: !739, file: !739, line: 298, type: !731, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!766 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !767, line: 63)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !768, line: 31, baseType: !769)
!768 = !DIFile(filename: "/usr/include/sys/_types/_wint_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wint_t", file: !191, line: 112, baseType: !20)
!770 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !771, line: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctrans_t", file: !772, line: 31, baseType: !773)
!772 = !DIFile(filename: "/usr/include/_types/_wctrans_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctrans_t", file: !774, line: 40, baseType: !20)
!774 = !DIFile(filename: "/usr/include/_types.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!775 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !776, line: 65)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !777, line: 31, baseType: !778)
!777 = !DIFile(filename: "/usr/include/_types/_wctype_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctype_t", file: !774, line: 42, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !191, line: 45, baseType: !301)
!780 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !781, line: 66)
!781 = !DISubprogram(name: "iswalnum", linkageName: "_Z8iswalnumi", scope: !782, file: !782, line: 66, type: !783, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!782 = !DIFile(filename: "/usr/include/_wctype.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!783 = !DISubroutineType(types: !784)
!784 = !{!20, !767}
!785 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !786, line: 67)
!786 = !DISubprogram(name: "iswalpha", linkageName: "_Z8iswalphai", scope: !782, file: !782, line: 72, type: !783, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!787 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !788, line: 68)
!788 = !DISubprogram(name: "iswblank", linkageName: "_Z8iswblanki", scope: !789, file: !789, line: 50, type: !783, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!789 = !DIFile(filename: "/usr/include/wctype.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!790 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !791, line: 69)
!791 = !DISubprogram(name: "iswcntrl", linkageName: "_Z8iswcntrli", scope: !782, file: !782, line: 78, type: !783, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!792 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !793, line: 70)
!793 = !DISubprogram(name: "iswdigit", linkageName: "_Z8iswdigiti", scope: !782, file: !782, line: 90, type: !783, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!794 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !795, line: 71)
!795 = !DISubprogram(name: "iswgraph", linkageName: "_Z8iswgraphi", scope: !782, file: !782, line: 96, type: !783, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!796 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !797, line: 72)
!797 = !DISubprogram(name: "iswlower", linkageName: "_Z8iswloweri", scope: !782, file: !782, line: 102, type: !783, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!798 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !799, line: 73)
!799 = !DISubprogram(name: "iswprint", linkageName: "_Z8iswprinti", scope: !782, file: !782, line: 108, type: !783, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!800 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !801, line: 74)
!801 = !DISubprogram(name: "iswpunct", linkageName: "_Z8iswpuncti", scope: !782, file: !782, line: 114, type: !783, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!802 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !803, line: 75)
!803 = !DISubprogram(name: "iswspace", linkageName: "_Z8iswspacei", scope: !782, file: !782, line: 120, type: !783, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!804 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !805, line: 76)
!805 = !DISubprogram(name: "iswupper", linkageName: "_Z8iswupperi", scope: !782, file: !782, line: 126, type: !783, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!806 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !807, line: 77)
!807 = !DISubprogram(name: "iswxdigit", linkageName: "_Z9iswxdigiti", scope: !782, file: !782, line: 132, type: !783, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!808 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !809, line: 78)
!809 = !DISubprogram(name: "iswctype", linkageName: "_Z8iswctypeij", scope: !782, file: !782, line: 84, type: !810, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!810 = !DISubroutineType(types: !811)
!811 = !{!20, !767, !776}
!812 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !813, line: 79)
!813 = !DISubprogram(name: "wctype", scope: !782, file: !782, line: 172, type: !814, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!814 = !DISubroutineType(types: !815)
!815 = !{!776, !214}
!816 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !817, line: 80)
!817 = !DISubprogram(name: "towlower", linkageName: "_Z8towloweri", scope: !782, file: !782, line: 138, type: !818, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!818 = !DISubroutineType(types: !819)
!819 = !{!767, !767}
!820 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !821, line: 81)
!821 = !DISubprogram(name: "towupper", linkageName: "_Z8towupperi", scope: !782, file: !782, line: 144, type: !818, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!822 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !823, line: 82)
!823 = !DISubprogram(name: "towctrans", scope: !789, file: !789, line: 121, type: !824, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!824 = !DISubroutineType(types: !825)
!825 = !{!767, !767, !771}
!826 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !827, line: 83)
!827 = !DISubprogram(name: "wctrans", scope: !789, file: !789, line: 123, type: !828, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!828 = !DISubroutineType(types: !829)
!829 = !{!771, !214}
!830 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !831, line: 116)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !832, line: 31, baseType: !833)
!832 = !DIFile(filename: "/usr/include/sys/_types/_mbstate_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mbstate_t", file: !191, line: 81, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !191, line: 79, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !191, line: 76, size: 1024, elements: !836, identifier: "_ZTS11__mbstate_t")
!836 = !{!837, !841}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !835, file: !191, line: 77, baseType: !838, size: 1024)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 1024, elements: !839)
!839 = !{!840}
!840 = !DISubrange(count: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !835, file: !191, line: 78, baseType: !289, size: 64)
!842 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !188, line: 117)
!843 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !844, line: 118)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !845, line: 73, size: 448, elements: !846, identifier: "_ZTS2tm")
!845 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!846 = !{!847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !844, file: !845, line: 74, baseType: !20, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !844, file: !845, line: 75, baseType: !20, size: 32, offset: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !844, file: !845, line: 76, baseType: !20, size: 32, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !844, file: !845, line: 77, baseType: !20, size: 32, offset: 96)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !844, file: !845, line: 78, baseType: !20, size: 32, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !844, file: !845, line: 79, baseType: !20, size: 32, offset: 160)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !844, file: !845, line: 80, baseType: !20, size: 32, offset: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !844, file: !845, line: 81, baseType: !20, size: 32, offset: 224)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !844, file: !845, line: 82, baseType: !20, size: 32, offset: 256)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !844, file: !845, line: 83, baseType: !186, size: 64, offset: 320)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !844, file: !845, line: 84, baseType: !212, size: 64, offset: 384)
!858 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !767, line: 119)
!859 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !521, line: 120)
!860 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !861, line: 121)
!861 = !DISubprogram(name: "fwprintf", scope: !862, file: !862, line: 103, type: !863, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!862 = !DIFile(filename: "/usr/include/wchar.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mo_release_acquire3")
!863 = !DISubroutineType(types: !864)
!864 = !{!20, !580, !518, null}
!865 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !866, line: 122)
!866 = !DISubprogram(name: "fwscanf", scope: !862, file: !862, line: 104, type: !863, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!867 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !868, line: 123)
!868 = !DISubprogram(name: "swprintf", scope: !862, file: !862, line: 115, type: !869, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!869 = !DISubroutineType(types: !870)
!870 = !{!20, !504, !188, !518, null}
!871 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !872, line: 124)
!872 = !DISubprogram(name: "vfwprintf", scope: !862, file: !862, line: 118, type: !873, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!873 = !DISubroutineType(types: !874)
!874 = !{!20, !580, !518, !613}
!875 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !876, line: 125)
!876 = !DISubprogram(name: "vswprintf", scope: !862, file: !862, line: 120, type: !877, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!877 = !DISubroutineType(types: !878)
!878 = !{!20, !504, !188, !518, !613}
!879 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !880, line: 126)
!880 = !DISubprogram(name: "swscanf", scope: !862, file: !862, line: 116, type: !881, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!881 = !DISubroutineType(types: !882)
!882 = !{!20, !518, !518, null}
!883 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !884, line: 127)
!884 = !DISubprogram(name: "vfwscanf", scope: !862, file: !862, line: 170, type: !873, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!885 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !886, line: 128)
!886 = !DISubprogram(name: "vswscanf", scope: !862, file: !862, line: 172, type: !887, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!887 = !DISubroutineType(types: !888)
!888 = !{!20, !518, !518, !613}
!889 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !890, line: 129)
!890 = !DISubprogram(name: "fgetwc", scope: !862, file: !862, line: 98, type: !891, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!891 = !DISubroutineType(types: !892)
!892 = !{!767, !580}
!893 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !894, line: 130)
!894 = !DISubprogram(name: "fgetws", scope: !862, file: !862, line: 99, type: !895, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!895 = !DISubroutineType(types: !896)
!896 = !{!504, !504, !20, !580}
!897 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !898, line: 131)
!898 = !DISubprogram(name: "fputwc", scope: !862, file: !862, line: 100, type: !899, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!899 = !DISubroutineType(types: !900)
!900 = !{!767, !505, !580}
