; ModuleID = 'test.bc'
source_filename = "test.cpp"
target datalayout = "e-m:o-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx10.10.0"

%"struct.std::__1::atomic" = type { %"struct.std::__1::__atomic_base" }
%"struct.std::__1::__atomic_base" = type { %"struct.std::__1::__atomic_base.0" }
%"struct.std::__1::__atomic_base.0" = type { i32 }

@x = global %"struct.std::__1::atomic" zeroinitializer, align 4, !dbg !0

; Function Attrs: noinline norecurse nounwind ssp uwtable
define i32 @main() #0 !dbg !1112 {
entry:
  %this.addr.i.i = alloca %"struct.std::__1::__atomic_base.0"*, align 8
  call void @llvm.dbg.declare(metadata %"struct.std::__1::__atomic_base.0"** %this.addr.i.i, metadata !1114, metadata !1117), !dbg !1118
  %__d.addr.i.i = alloca i32, align 4
  call void @llvm.dbg.declare(metadata i32* %__d.addr.i.i, metadata !1122, metadata !1117), !dbg !1123
  %__m.addr.i.i = alloca i32, align 4
  call void @llvm.dbg.declare(metadata i32* %__m.addr.i.i, metadata !1124, metadata !1117), !dbg !1125
  %.atomictmp.i.i = alloca i32, align 4
  %this.addr.i = alloca %"struct.std::__1::atomic"*, align 8
  call void @llvm.dbg.declare(metadata %"struct.std::__1::atomic"** %this.addr.i, metadata !1126, metadata !1117), !dbg !1128
  %__d.addr.i = alloca i32, align 4
  call void @llvm.dbg.declare(metadata i32* %__d.addr.i, metadata !1129, metadata !1117), !dbg !1130
  %retval = alloca i32, align 4
  store i32 0, i32* %retval, align 4

!137 = !DIFile(filename: "/usr/include/_types/_uint32_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!138 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!139 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !140, line: 161)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !141, line: 31, baseType: !142)
!141 = !DIFile(filename: "/usr/include/_types/_uint64_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!142 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!143 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !144, line: 163)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !145, line: 29, baseType: !113)
!145 = !DIFile(filename: "/usr/include/stdint.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!146 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !147, line: 164)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !145, line: 30, baseType: !117)
!148 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !149, line: 165)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !145, line: 31, baseType: !121)
!150 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !151, line: 166)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !145, line: 32, baseType: !124)
!152 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !153, line: 168)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !145, line: 33, baseType: !128)
!154 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !155, line: 169)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !145, line: 34, baseType: !132)
!156 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !157, line: 170)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !145, line: 35, baseType: !136)
!158 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !159, line: 171)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !145, line: 36, baseType: !140)
!160 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !161, line: 173)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !145, line: 40, baseType: !113)
!162 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !163, line: 174)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !145, line: 41, baseType: !117)
!164 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !165, line: 175)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !145, line: 42, baseType: !121)
!166 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !167, line: 176)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !145, line: 43, baseType: !124)
!168 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !169, line: 178)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !145, line: 44, baseType: !128)
!170 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !171, line: 179)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !145, line: 45, baseType: !132)
!172 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !173, line: 180)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !145, line: 46, baseType: !136)
!174 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !175, line: 181)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !145, line: 47, baseType: !140)
!176 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !177, line: 183)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !178, line: 30, baseType: !179)
!178 = !DIFile(filename: "/usr/include/sys/_types/_intptr_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !27, line: 49, baseType: !22)
!180 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !181, line: 184)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !182, line: 30, baseType: !28)
!182 = !DIFile(filename: "/usr/include/sys/_types/_uintptr_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!183 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !184, line: 186)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !185, line: 32, baseType: !22)
!185 = !DIFile(filename: "/usr/include/_types/_intmax_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!186 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !187, line: 187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !188, line: 32, baseType: !28)
!188 = !DIFile(filename: "/usr/include/_types/_uintmax_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!189 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !24, line: 100)
!190 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !191, line: 101)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !192, line: 85, baseType: !193)
!192 = !DIFile(filename: "/usr/include/stdlib.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 82, size: 64, elements: !194, identifier: "_ZTS5div_t")
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !193, file: !192, line: 83, baseType: !64, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !193, file: !192, line: 84, baseType: !64, size: 32, offset: 32)
!197 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !198, line: 102)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !192, line: 90, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 87, size: 128, elements: !200, identifier: "_ZTS6ldiv_t")
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !199, file: !192, line: 88, baseType: !22, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !199, file: !192, line: 89, baseType: !22, size: 64, offset: 64)
!203 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !204, line: 104)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !192, line: 96, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 93, size: 128, elements: !206, identifier: "_ZTS7lldiv_t")
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !205, file: !192, line: 94, baseType: !126, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !205, file: !192, line: 95, baseType: !126, size: 64, offset: 64)
!209 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !210, line: 106)
!210 = !DISubprogram(name: "atof", scope: !192, file: !192, line: 131, type: !211, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !50}
!213 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!214 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !215, line: 107)
!215 = !DISubprogram(name: "atoi", scope: !192, file: !192, line: 132, type: !216, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!216 = !DISubroutineType(types: !217)
!217 = !{!64, !50}
!218 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !219, line: 108)
!219 = !DISubprogram(name: "atol", scope: !192, file: !192, line: 133, type: !220, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!220 = !DISubroutineType(types: !221)
!221 = !{!22, !50}
!222 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !223, line: 110)
!223 = !DISubprogram(name: "atoll", scope: !192, file: !192, line: 136, type: !224, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!224 = !DISubroutineType(types: !225)
!225 = !{!126, !50}
!226 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !227, line: 112)
!227 = !DISubprogram(name: "strtod", linkageName: "\01_strtod", scope: !192, file: !192, line: 162, type: !228, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!228 = !DISubroutineType(types: !229)
!229 = !{!213, !50, !230}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!231 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !232, line: 113)
!232 = !DISubprogram(name: "strtof", linkageName: "\01_strtof", scope: !192, file: !192, line: 163, type: !233, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!233 = !DISubroutineType(types: !234)
!234 = !{!235, !50, !230}
!235 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!236 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !237, line: 114)
!237 = !DISubprogram(name: "strtold", scope: !192, file: !192, line: 166, type: !238, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!238 = !DISubroutineType(types: !239)
!239 = !{!32, !50, !230}
!240 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !241, line: 115)
!241 = !DISubprogram(name: "strtol", scope: !192, file: !192, line: 164, type: !242, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!242 = !DISubroutineType(types: !243)
!243 = !{!22, !50, !230, !64}
!244 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !245, line: 117)
!245 = !DISubprogram(name: "strtoll", scope: !192, file: !192, line: 169, type: !246, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!246 = !DISubroutineType(types: !247)
!247 = !{!126, !50, !230, !64}
!248 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !249, line: 119)
!249 = !DISubprogram(name: "strtoul", scope: !192, file: !192, line: 172, type: !250, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!250 = !DISubroutineType(types: !251)
!251 = !{!28, !50, !230, !64}
!252 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !253, line: 121)
!253 = !DISubprogram(name: "strtoull", scope: !192, file: !192, line: 175, type: !254, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!254 = !DISubroutineType(types: !255)
!255 = !{!142, !50, !230, !64}
!256 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !257, line: 123)
!257 = !DISubprogram(name: "rand", scope: !192, file: !192, line: 159, type: !258, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!258 = !DISubroutineType(types: !259)
!259 = !{!64}
!260 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !261, line: 124)
!261 = !DISubprogram(name: "srand", scope: !192, file: !192, line: 161, type: !262, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !138}
!264 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !265, line: 125)
!265 = !DISubprogram(name: "calloc", scope: !192, file: !192, line: 140, type: !266, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!266 = !DISubroutineType(types: !267)
!267 = !{!39, !24, !24}
!268 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !269, line: 126)
!269 = !DISubprogram(name: "free", scope: !192, file: !192, line: 143, type: !270, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !39}
!272 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !273, line: 127)
!273 = !DISubprogram(name: "malloc", scope: !192, file: !192, line: 152, type: !274, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!274 = !DISubroutineType(types: !275)
!275 = !{!39, !24}
!276 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !277, line: 128)
!277 = !DISubprogram(name: "realloc", scope: !192, file: !192, line: 160, type: !278, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!278 = !DISubroutineType(types: !279)
!279 = !{!39, !39, !24}
!280 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !281, line: 129)
!281 = !DISubprogram(name: "abort", scope: !192, file: !192, line: 128, type: !282, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!282 = !DISubroutineType(types: !283)
!283 = !{null}
!284 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !285, line: 130)
!285 = !DISubprogram(name: "atexit", scope: !192, file: !192, line: 130, type: !286, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!286 = !DISubroutineType(types: !287)
!287 = !{!64, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!289 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !290, line: 131)
!290 = !DISubprogram(name: "exit", scope: !192, file: !192, line: 142, type: !291, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !64}
!293 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !294, line: 132)
!294 = !DISubprogram(name: "_Exit", scope: !192, file: !192, line: 182, type: !291, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: false)
!295 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !296, line: 134)
!296 = !DISubprogram(name: "getenv", scope: !192, file: !192, line: 144, type: !297, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!297 = !DISubroutineType(types: !298)
!298 = !{!48, !50}
!299 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !300, line: 135)
!300 = !DISubprogram(name: "system", linkageName: "\01_system", scope: !192, file: !192, line: 177, type: !216, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!301 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !302, line: 137)
!302 = !DISubprogram(name: "bsearch", scope: !192, file: !192, line: 138, type: !303, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!303 = !DISubroutineType(types: !304)
!304 = !{!39, !40, !40, !24, !24, !305}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{!64, !40, !40}
!308 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !309, line: 138)
!309 = !DISubprogram(name: "qsort", scope: !192, file: !192, line: 157, type: !310, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !39, !24, !24, !305}
!312 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !313, line: 139)
!313 = !DISubprogram(name: "abs", linkageName: "_Z3absx", scope: !314, file: !314, line: 113, type: !315, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!314 = !DIFile(filename: "/Users/aser/Documents/LLVM/llvm-4.0/build/bin/../include/c++/v1/stdlib.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!315 = !DISubroutineType(types: !316)
!316 = !{!126, !126}
!317 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !318, line: 140)
!318 = !DISubprogram(name: "labs", scope: !192, file: !192, line: 145, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!319 = !DISubroutineType(types: !320)
!320 = !{!22, !22}
!321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !322, line: 142)
!322 = !DISubprogram(name: "llabs", scope: !192, file: !192, line: 149, type: !315, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!323 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !324, line: 144)
!324 = !DISubprogram(name: "div", linkageName: "_Z3divxx", scope: !314, file: !314, line: 118, type: !325, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!325 = !DISubroutineType(types: !326)
!326 = !{!204, !126, !126}
!327 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !328, line: 145)
!328 = !DISubprogram(name: "ldiv", scope: !192, file: !192, line: 146, type: !329, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!329 = !DISubroutineType(types: !330)
!330 = !{!198, !22, !22}
!331 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !332, line: 147)
!332 = !DISubprogram(name: "lldiv", scope: !192, file: !192, line: 150, type: !325, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!333 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !334, line: 149)
!334 = !DISubprogram(name: "mblen", scope: !192, file: !192, line: 153, type: !335, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!335 = !DISubroutineType(types: !336)
!336 = !{!64, !50, !24}
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !338, line: 150)
!338 = !DISubprogram(name: "mbtowc", scope: !192, file: !192, line: 155, type: !339, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!339 = !DISubroutineType(types: !340)
!340 = !{!64, !341, !50, !24}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !344, line: 151)
!344 = !DISubprogram(name: "wctomb", scope: !192, file: !192, line: 179, type: !345, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!345 = !DISubroutineType(types: !346)
!346 = !{!64, !48, !342}
!347 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !348, line: 152)
!348 = !DISubprogram(name: "mbstowcs", scope: !192, file: !192, line: 154, type: !349, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!349 = !DISubroutineType(types: !350)
!350 = !{!24, !341, !50, !24}
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !352, line: 153)
!352 = !DISubprogram(name: "wcstombs", scope: !192, file: !192, line: 178, type: !353, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!353 = !DISubroutineType(types: !354)
!354 = !{!24, !48, !355, !24}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !342)
!357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !358, line: 108)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !359, line: 153, baseType: !360)
!359 = !DIFile(filename: "/usr/include/stdio.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !359, line: 122, size: 1216, elements: !361, identifier: "_ZTS7__sFILE")
!361 = !{!362, !364, !365, !366, !367, !368, !373, !374, !375, !379, !383, !391, !395, !396, !399, !400, !404, !408, !409, !410}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !360, file: !359, line: 123, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !360, file: !359, line: 124, baseType: !64, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !360, file: !359, line: 125, baseType: !64, size: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !360, file: !359, line: 126, baseType: !119, size: 16, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !360, file: !359, line: 127, baseType: !119, size: 16, offset: 144)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !360, file: !359, line: 128, baseType: !369, size: 128, offset: 192)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !359, line: 88, size: 128, elements: !370, identifier: "_ZTS6__sbuf")
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !369, file: !359, line: 89, baseType: !363, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !369, file: !359, line: 90, baseType: !64, size: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !360, file: !359, line: 129, baseType: !64, size: 32, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !360, file: !359, line: 132, baseType: !39, size: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !360, file: !359, line: 133, baseType: !376, size: 64, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!64, !39}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !360, file: !359, line: 134, baseType: !380, size: 64, offset: 512)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!64, !39, !48, !64}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !360, file: !359, line: 135, baseType: !384, size: 64, offset: 576)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{!387, !39, !387, !64}
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !359, line: 77, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !389, line: 71, baseType: !390)
!389 = !DIFile(filename: "/usr/include/sys/_types.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !27, line: 46, baseType: !126)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !360, file: !359, line: 136, baseType: !392, size: 64, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{!64, !39, !50, !64}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !360, file: !359, line: 139, baseType: !369, size: 128, offset: 704)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !360, file: !359, line: 140, baseType: !397, size: 64, offset: 832)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !359, line: 94, flags: DIFlagFwdDecl, identifier: "_ZTS8__sFILEX")
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !360, file: !359, line: 141, baseType: !64, size: 32, offset: 896)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !360, file: !359, line: 144, baseType: !401, size: 24, offset: 928)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 24, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 3)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !360, file: !359, line: 145, baseType: !405, size: 8, offset: 952)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 8, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 1)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !360, file: !359, line: 148, baseType: !369, size: 128, offset: 960)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !360, file: !359, line: 151, baseType: !64, size: 32, offset: 1088)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !360, file: !359, line: 152, baseType: !387, size: 64, offset: 1152)
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !387, line: 109)
!412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !24, line: 110)
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !414, line: 112)
!414 = !DISubprogram(name: "fclose", scope: !359, file: !359, line: 232, type: !415, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!415 = !DISubroutineType(types: !416)
!416 = !{!64, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !419, line: 113)
!419 = !DISubprogram(name: "fflush", scope: !359, file: !359, line: 235, type: !415, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !421, line: 114)
!421 = !DISubprogram(name: "setbuf", scope: !359, file: !359, line: 267, type: !422, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !417, !48}
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !425, line: 115)
!425 = !DISubprogram(name: "setvbuf", scope: !359, file: !359, line: 268, type: !426, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!426 = !DISubroutineType(types: !427)
!427 = !{!64, !417, !48, !64, !24}
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !429, line: 116)
!429 = !DISubprogram(name: "fprintf", scope: !359, file: !359, line: 244, type: !430, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!430 = !DISubroutineType(types: !431)
!431 = !{!64, !417, !50, null}
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !433, line: 117)
!433 = !DISubprogram(name: "fscanf", scope: !359, file: !359, line: 250, type: !430, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !435, line: 118)
!435 = !DISubprogram(name: "snprintf", scope: !359, file: !359, line: 421, type: !436, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!436 = !DISubroutineType(types: !437)
!437 = !{!64, !48, !24, !50, null}
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !439, line: 119)
!439 = !DISubprogram(name: "sprintf", scope: !359, file: !359, line: 269, type: !440, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!440 = !DISubroutineType(types: !441)
!441 = !{!64, !48, !50, null}
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !443, line: 120)
!443 = !DISubprogram(name: "sscanf", scope: !359, file: !359, line: 270, type: !444, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!444 = !DISubroutineType(types: !445)
!445 = !{!64, !50, !50, null}
!446 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !447, line: 121)
!447 = !DISubprogram(name: "vfprintf", scope: !359, file: !359, line: 278, type: !448, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!448 = !DISubroutineType(types: !449)
!449 = !{!64, !417, !50, !450}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !452, identifier: "_ZTS13__va_list_tag")
!452 = !{!453, !454, !455, !456}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !451, file: !3, baseType: !138, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !451, file: !3, baseType: !138, size: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !451, file: !3, baseType: !39, size: 64, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !451, file: !3, baseType: !39, size: 64, offset: 128)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !458, line: 122)
!458 = !DISubprogram(name: "vfscanf", scope: !359, file: !359, line: 422, type: !448, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !460, line: 123)
!460 = !DISubprogram(name: "vsscanf", scope: !359, file: !359, line: 425, type: !461, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!461 = !DISubroutineType(types: !462)
!462 = !{!64, !50, !50, !450}
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !464, line: 124)
!464 = !DISubprogram(name: "vsnprintf", scope: !359, file: !359, line: 424, type: !465, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!465 = !DISubroutineType(types: !466)
!466 = !{!64, !48, !24, !50, !450}
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !468, line: 125)
!468 = !DISubprogram(name: "vsprintf", scope: !359, file: !359, line: 280, type: !469, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!469 = !DISubroutineType(types: !470)
!470 = !{!64, !48, !50, !450}
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !472, line: 126)
!472 = !DISubprogram(name: "fgetc", scope: !359, file: !359, line: 236, type: !415, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !474, line: 127)
!474 = !DISubprogram(name: "fgets", scope: !359, file: !359, line: 238, type: !475, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!475 = !DISubroutineType(types: !476)
!476 = !{!48, !48, !64, !417}
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !478, line: 128)
!478 = !DISubprogram(name: "fputc", scope: !359, file: !359, line: 245, type: !479, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!479 = !DISubroutineType(types: !480)
!480 = !{!64, !64, !417}
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !482, line: 129)
!482 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !359, file: !359, line: 246, type: !483, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!483 = !DISubroutineType(types: !484)
!484 = !{!64, !50, !417}
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !486, line: 130)
!486 = !DISubprogram(name: "getc", scope: !359, file: !359, line: 255, type: !415, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !488, line: 131)
!488 = !DISubprogram(name: "putc", scope: !359, file: !359, line: 260, type: !479, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !490, line: 132)
!490 = !DISubprogram(name: "ungetc", scope: !359, file: !359, line: 277, type: !479, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !492, line: 133)
!492 = !DISubprogram(name: "fread", scope: !359, file: !359, line: 247, type: !493, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!493 = !DISubroutineType(types: !494)
!494 = !{!24, !39, !24, !24, !417}
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !496, line: 134)
!496 = !DISubprogram(name: "fwrite", linkageName: "\01_fwrite", scope: !359, file: !359, line: 254, type: !497, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!497 = !DISubroutineType(types: !498)
!498 = !{!24, !40, !24, !24, !417}
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !500, line: 135)
!500 = !DISubprogram(name: "fgetpos", scope: !359, file: !359, line: 237, type: !501, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!501 = !DISubroutineType(types: !502)
!502 = !{!64, !417, !503}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !505, line: 136)
!505 = !DISubprogram(name: "fseek", scope: !359, file: !359, line: 251, type: !506, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!506 = !DISubroutineType(types: !507)
!507 = !{!64, !417, !22, !64}
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !509, line: 137)
!509 = !DISubprogram(name: "fsetpos", scope: !359, file: !359, line: 252, type: !510, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!510 = !DISubroutineType(types: !511)
!511 = !{!64, !417, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !515, line: 138)
!515 = !DISubprogram(name: "ftell", scope: !359, file: !359, line: 253, type: !516, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!516 = !DISubroutineType(types: !517)
!517 = !{!22, !417}
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !519, line: 139)
!519 = !DISubprogram(name: "rewind", scope: !359, file: !359, line: 265, type: !520, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !417}
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !523, line: 140)
!523 = !DISubprogram(name: "clearerr", scope: !359, file: !359, line: 231, type: !520, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !525, line: 141)
!525 = !DISubprogram(name: "feof", scope: !359, file: !359, line: 233, type: !415, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !527, line: 142)
!527 = !DISubprogram(name: "ferror", scope: !359, file: !359, line: 234, type: !415, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !529, line: 143)
!529 = !DISubprogram(name: "perror", scope: !359, file: !359, line: 258, type: !530, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !50}
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !533, line: 146)
!533 = !DISubprogram(name: "fopen", linkageName: "\01_fopen", scope: !359, file: !359, line: 242, type: !534, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!534 = !DISubroutineType(types: !535)
!535 = !{!417, !50, !50}
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !537, line: 147)
!537 = !DISubprogram(name: "freopen", linkageName: "\01_freopen", scope: !359, file: !359, line: 248, type: !538, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!538 = !DISubroutineType(types: !539)
!539 = !{!417, !50, !50, !417}
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !541, line: 148)
!541 = !DISubprogram(name: "remove", scope: !359, file: !359, line: 263, type: !216, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!542 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !543, line: 149)
!543 = !DISubprogram(name: "rename", scope: !359, file: !359, line: 264, type: !67, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !545, line: 150)
!545 = !DISubprogram(name: "tmpfile", scope: !359, file: !359, line: 271, type: !546, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!546 = !DISubroutineType(types: !547)
!547 = !{!417}
!548 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !549, line: 151)
!549 = !DISubprogram(name: "tmpnam", scope: !359, file: !359, line: 276, type: !550, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!550 = !DISubroutineType(types: !551)
!551 = !{!48, !48}
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !553, line: 155)
!553 = !DISubprogram(name: "getchar", scope: !359, file: !359, line: 256, type: !258, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !555, line: 157)
!555 = !DISubprogram(name: "gets", scope: !359, file: !359, line: 257, type: !550, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !557, line: 159)
!557 = !DISubprogram(name: "scanf", scope: !359, file: !359, line: 266, type: !558, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!558 = !DISubroutineType(types: !559)
!559 = !{!64, !50, null}
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !561, line: 160)
!561 = !DISubprogram(name: "vscanf", scope: !359, file: !359, line: 423, type: !562, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!562 = !DISubroutineType(types: !563)
!563 = !{!64, !50, !450}
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !565, line: 164)
!565 = !DISubprogram(name: "printf", scope: !359, file: !359, line: 259, type: !558, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !567, line: 165)
!567 = !DISubprogram(name: "putchar", scope: !359, file: !359, line: 261, type: !568, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!568 = !DISubroutineType(types: !569)
!569 = !{!64, !64}
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !571, line: 166)
!571 = !DISubprogram(name: "puts", scope: !359, file: !359, line: 262, type: !216, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !573, line: 167)
!573 = !DISubprogram(name: "vprintf", scope: !359, file: !359, line: 279, type: !562, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !575, line: 104)
!575 = !DISubprogram(name: "isalnum", linkageName: "_Z7isalnumi", scope: !576, file: !576, line: 212, type: !568, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!576 = !DIFile(filename: "/usr/include/ctype.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !578, line: 105)
!578 = !DISubprogram(name: "isalpha", linkageName: "_Z7isalphai", scope: !576, file: !576, line: 218, type: !568, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !580, line: 106)
!580 = !DISubprogram(name: "isblank", linkageName: "_Z7isblanki", scope: !576, file: !576, line: 224, type: !568, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !582, line: 107)
!582 = !DISubprogram(name: "iscntrl", linkageName: "_Z7iscntrli", scope: !576, file: !576, line: 230, type: !568, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !584, line: 108)
!584 = !DISubprogram(name: "isdigit", linkageName: "_Z7isdigiti", scope: !576, file: !576, line: 237, type: !568, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!585 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !586, line: 109)
!586 = !DISubprogram(name: "isgraph", linkageName: "_Z7isgraphi", scope: !576, file: !576, line: 243, type: !568, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !588, line: 110)
!588 = !DISubprogram(name: "islower", linkageName: "_Z7isloweri", scope: !576, file: !576, line: 249, type: !568, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !590, line: 111)
!590 = !DISubprogram(name: "isprint", linkageName: "_Z7isprinti", scope: !576, file: !576, line: 255, type: !568, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !592, line: 112)
!592 = !DISubprogram(name: "ispunct", linkageName: "_Z7ispuncti", scope: !576, file: !576, line: 261, type: !568, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !594, line: 113)
!594 = !DISubprogram(name: "isspace", linkageName: "_Z7isspacei", scope: !576, file: !576, line: 267, type: !568, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !596, line: 114)
!596 = !DISubprogram(name: "isupper", linkageName: "_Z7isupperi", scope: !576, file: !576, line: 273, type: !568, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !598, line: 115)
!598 = !DISubprogram(name: "isxdigit", linkageName: "_Z8isxdigiti", scope: !576, file: !576, line: 280, type: !568, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!599 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !600, line: 116)
!600 = !DISubprogram(name: "tolower", linkageName: "_Z7toloweri", scope: !576, file: !576, line: 292, type: !568, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !602, line: 117)
!602 = !DISubprogram(name: "toupper", linkageName: "_Z7toupperi", scope: !576, file: !576, line: 298, type: !568, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!603 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !604, line: 63)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !605, line: 31, baseType: !606)
!605 = !DIFile(filename: "/usr/include/sys/_types/_wint_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wint_t", file: !27, line: 112, baseType: !64)
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !608, line: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctrans_t", file: !609, line: 31, baseType: !610)
!609 = !DIFile(filename: "/usr/include/_types/_wctrans_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctrans_t", file: !611, line: 40, baseType: !64)
!611 = !DIFile(filename: "/usr/include/_types.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!612 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !613, line: 65)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !614, line: 31, baseType: !615)
!614 = !DIFile(filename: "/usr/include/_types/_wctype_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctype_t", file: !611, line: 42, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !27, line: 45, baseType: !138)
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !618, line: 66)
!618 = !DISubprogram(name: "iswalnum", linkageName: "_Z8iswalnumi", scope: !619, file: !619, line: 66, type: !620, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!619 = !DIFile(filename: "/usr/include/_wctype.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!620 = !DISubroutineType(types: !621)
!621 = !{!64, !604}
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !623, line: 67)
!623 = !DISubprogram(name: "iswalpha", linkageName: "_Z8iswalphai", scope: !619, file: !619, line: 72, type: !620, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!624 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !625, line: 68)
!625 = !DISubprogram(name: "iswblank", linkageName: "_Z8iswblanki", scope: !626, file: !626, line: 50, type: !620, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!626 = !DIFile(filename: "/usr/include/wctype.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !628, line: 69)
!628 = !DISubprogram(name: "iswcntrl", linkageName: "_Z8iswcntrli", scope: !619, file: !619, line: 78, type: !620, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !630, line: 70)
!630 = !DISubprogram(name: "iswdigit", linkageName: "_Z8iswdigiti", scope: !619, file: !619, line: 90, type: !620, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !632, line: 71)
!632 = !DISubprogram(name: "iswgraph", linkageName: "_Z8iswgraphi", scope: !619, file: !619, line: 96, type: !620, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !634, line: 72)
!634 = !DISubprogram(name: "iswlower", linkageName: "_Z8iswloweri", scope: !619, file: !619, line: 102, type: !620, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !636, line: 73)
!636 = !DISubprogram(name: "iswprint", linkageName: "_Z8iswprinti", scope: !619, file: !619, line: 108, type: !620, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !638, line: 74)
!638 = !DISubprogram(name: "iswpunct", linkageName: "_Z8iswpuncti", scope: !619, file: !619, line: 114, type: !620, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !640, line: 75)
!640 = !DISubprogram(name: "iswspace", linkageName: "_Z8iswspacei", scope: !619, file: !619, line: 120, type: !620, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !642, line: 76)
!642 = !DISubprogram(name: "iswupper", linkageName: "_Z8iswupperi", scope: !619, file: !619, line: 126, type: !620, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !644, line: 77)
!644 = !DISubprogram(name: "iswxdigit", linkageName: "_Z9iswxdigiti", scope: !619, file: !619, line: 132, type: !620, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !646, line: 78)
!646 = !DISubprogram(name: "iswctype", linkageName: "_Z8iswctypeij", scope: !619, file: !619, line: 84, type: !647, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!647 = !DISubroutineType(types: !648)
!648 = !{!64, !604, !613}
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !650, line: 79)
!650 = !DISubprogram(name: "wctype", scope: !619, file: !619, line: 172, type: !651, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!651 = !DISubroutineType(types: !652)
!652 = !{!613, !50}
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !654, line: 80)
!654 = !DISubprogram(name: "towlower", linkageName: "_Z8towloweri", scope: !619, file: !619, line: 138, type: !655, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!655 = !DISubroutineType(types: !656)
!656 = !{!604, !604}
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !658, line: 81)
!658 = !DISubprogram(name: "towupper", linkageName: "_Z8towupperi", scope: !619, file: !619, line: 144, type: !655, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!659 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !660, line: 82)
!660 = !DISubprogram(name: "towctrans", scope: !626, file: !626, line: 121, type: !661, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!661 = !DISubroutineType(types: !662)
!662 = !{!604, !604, !608}
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !664, line: 83)
!664 = !DISubprogram(name: "wctrans", scope: !626, file: !626, line: 123, type: !665, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!665 = !DISubroutineType(types: !666)
!666 = !{!608, !50}
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !668, line: 116)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !669, line: 31, baseType: !670)
!669 = !DIFile(filename: "/usr/include/sys/_types/_mbstate_t.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mbstate_t", file: !27, line: 81, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !27, line: 79, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !27, line: 76, size: 1024, elements: !673, identifier: "_ZTS11__mbstate_t")
!673 = !{!674, !678}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !672, file: !27, line: 77, baseType: !675, size: 1024)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 1024, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !672, file: !27, line: 78, baseType: !126, size: 64)
!679 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !24, line: 117)
!680 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !681, line: 118)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !682, line: 73, size: 448, elements: !683, identifier: "_ZTS2tm")
!682 = !DIFile(filename: "/usr/include/time.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!683 = !{!684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !681, file: !682, line: 74, baseType: !64, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !681, file: !682, line: 75, baseType: !64, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !681, file: !682, line: 76, baseType: !64, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !681, file: !682, line: 77, baseType: !64, size: 32, offset: 96)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !681, file: !682, line: 78, baseType: !64, size: 32, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !681, file: !682, line: 79, baseType: !64, size: 32, offset: 160)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !681, file: !682, line: 80, baseType: !64, size: 32, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !681, file: !682, line: 81, baseType: !64, size: 32, offset: 224)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !681, file: !682, line: 82, baseType: !64, size: 32, offset: 256)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !681, file: !682, line: 83, baseType: !22, size: 64, offset: 320)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !681, file: !682, line: 84, baseType: !48, size: 64, offset: 384)
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !604, line: 119)
!696 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !358, line: 120)
!697 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !698, line: 121)
!698 = !DISubprogram(name: "fwprintf", scope: !699, file: !699, line: 103, type: !700, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!699 = !DIFile(filename: "/usr/include/wchar.h", directory: "/Users/aser/Dropbox/papers/C++11/Checker11/examples/mutex2")
!700 = !DISubroutineType(types: !701)
!701 = !{!64, !417, !355, null}
!702 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !703, line: 122)
!703 = !DISubprogram(name: "fwscanf", scope: !699, file: !699, line: 104, type: !700, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!704 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !705, line: 123)
!705 = !DISubprogram(name: "swprintf", scope: !699, file: !699, line: 115, type: !706, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!706 = !DISubroutineType(types: !707)
!707 = !{!64, !341, !24, !355, null}
!708 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !709, line: 124)
!709 = !DISubprogram(name: "vfwprintf", scope: !699, file: !699, line: 118, type: !710, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!710 = !DISubroutineType(types: !711)
!711 = !{!64, !417, !355, !450}
!712 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !713, line: 125)
!713 = !DISubprogram(name: "vswprintf", scope: !699, file: !699, line: 120, type: !714, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!714 = !DISubroutineType(types: !715)
!715 = !{!64, !341, !24, !355, !450}
!716 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !717, line: 126)
!717 = !DISubprogram(name: "swscanf", scope: !699, file: !699, line: 116, type: !718, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!718 = !DISubroutineType(types: !719)
!719 = !{!64, !355, !355, null}
!720 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !721, line: 127)
!721 = !DISubprogram(name: "vfwscanf", scope: !699, file: !699, line: 170, type: !710, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!722 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !723, line: 128)
!723 = !DISubprogram(name: "vswscanf", scope: !699, file: !699, line: 172, type: !724, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!724 = !DISubroutineType(types: !725)
!725 = !{!64, !355, !355, !450}
!726 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !727, line: 129)
!727 = !DISubprogram(name: "fgetwc", scope: !699, file: !699, line: 98, type: !728, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!728 = !DISubroutineType(types: !729)
!729 = !{!604, !417}
!730 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !731, line: 130)
!731 = !DISubprogram(name: "fgetws", scope: !699, file: !699, line: 99, type: !732, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!732 = !DISubroutineType(types: !733)
!733 = !{!341, !341, !64, !417}
!734 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !7, entity: !735, line: 131)
!735 = !DISubprogram(name: "fputwc", scope: !699, file: !699, line: 100, type: !736, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!736 = !DISubroutineType(types: !737)
!737 = !{!604, !342, !417}
